[
  {
    "title": "The Bestseller Code",
    "authors": [
      "Jodie Archer",
      "Matthew L. Jockers"
    ],
    "isbn": "9781250088277",
    "edition": "3",
    "genre": "Business & Economics",
    "publisher": "Macmillan",
    "published_date": "2016-09-20",
    "stock": 29,
    "status": "Available",
    "description": "\"What if there was an algorithm that could predict which novels become mega-bestsellers? Are books like Dan Brown's The Da Vinci Code and Gillian Flynn's Gone Girl the Gladwellian outliers of publishing? [This book] boldly claims that the New York Times bestsellers in fiction are predictable and that it's possible to know with 97% certainty if a manuscript is likely to hit number one on the list as opposed to numbers two through fifteen. The algorithm does exist; the code has been cracked; the results are in\"--",
    "image": "http://books.google.com/books/content?id=4fXUDAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9781250088277.png"
  },
  {
    "title": "Masterclass: Write a Bestseller",
    "authors": [
      "Jacq Burns"
    ],
    "isbn": "9781473600058",
    "edition": "1",
    "genre": "Language Arts & Disciplines",
    "publisher": "Hachette UK",
    "published_date": "2014-10-31",
    "stock": 12,
    "status": "Checked Out",
    "description": "LEARN HOW TO WRITE A BOOK WHICH STANDS OUT FROM THE CROWD. There is no precise formula for writing a bestseller, but there are secrets, skills and techniques that will dramatically improve your odds of publishing a bestselling novel. Whatever your motivation - whether sick of rejections, getting ready to approach a publisher, or with an idea you think is unbeatable - you need to read this book before you do anything else. It gives you the key insights into what makes a bestseller and explains the trends and conventions of different genres, before helping you get a real handle on the writing (and revising) process. A third of the book is devoted to pitching and selling your novel both to traditional agents and as a self-published author, with incisive and cutting-edge insights into writing for Amazon and becoming an 'authorpreneur'. ABOUT THE SERIES The Teach Yourself Creative Writing series helps aspiring authors tell their story. Covering a range of genres from science fiction and romantic novels, to illustrated children's books and comedy, this series is packed with advice, exercises and tips for unlocking creativity and improving your writing. And because we know how daunting the blank page can be, we set up the Just Write online community at tyjustwrite, for budding authors and successful writers to connect and share.",
    "image": "http://books.google.com/books/content?id=3i3vAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781473600058.png"
  },
  {
    "title": "Tagalog Bestsellers of the Twentieth Century",
    "authors": [
      "Patricia May B. Jurilla"
    ],
    "isbn": "9789715505635",
    "edition": "3",
    "genre": "History",
    "publisher": "Ateneo University Press",
    "published_date": "2008",
    "stock": 11,
    "status": "Reserved",
    "description": "This pioneering work spans more than four centuries of publishing, from 1593, when the first book was printed in the country, to 2003, when the first nationwide survey on reading attitudes and preference was conducted.",
    "image": "http://books.google.com/books/content?id=p0CCXhV_F68C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9789715505635.png"
  },
  {
    "title": "The Making of a Bestseller",
    "authors": [
      "Arthur T. Vanderbilt"
    ],
    "isbn": "9780786406630",
    "edition": "5",
    "genre": "Language Arts & Disciplines",
    "publisher": "McFarland",
    "published_date": "1999-01-01",
    "stock": 27,
    "status": "Reserved",
    "description": "Writer F. Scott Fitzgerald's career itself is a metaphor for the vagaries of book publishing. If Fitzgerald would have had his way, we would today refer to The Great Gatsby as either Gold-Hatted Gatsby, Trimalchio in West Egg, or The High-Bouncing Lover. A few years before Gatsby, Fitzgerald had become a literary sensation at the age of 23; Helen Hooven Santmyer, a contemporary of Fitzgerald's, would not have a successful novel published until she was 88 and living in a nursing home. In this book, the author explores that mysterious place in publishing where art and commerce can either clash, mesh, or both. Along the way, a wide range of authors--from the literary greats to today's commercial superstars--editors, agents and publishers share their thoughts, insights and experiences: What inspires writers? (John Steinbeck, for example, wrote every novel as if it were his last, as if death were imminent.) Why are some books successful and appreciated, while others fall into oblivion? The answers are often elusive, never absolute, but the stories and anecdotes are always fascinating.",
    "image": "http://books.google.com/books/content?id=54qLAaxz19wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780786406630.png"
  },
  {
    "title": "Without Their Permission",
    "authors": [
      "Alexis Ohanian"
    ],
    "isbn": "9781455520039",
    "edition": "3",
    "genre": "Business & Economics",
    "publisher": "Hachette UK",
    "published_date": "2013-10-01",
    "stock": 17,
    "status": "Available",
    "description": "As Alexis Ohanian learned when he helped to co-found the immensely popular reddit.com, the internet is the most powerful and democratic tool for disseminating information in human history. And when that power is harnessed to create new communities, technologies, businesses or charities, the results can be absolutely stunning. In this book, Alexis will share his ideas, tips and even his own doodles about harnessing the power of the web for good, and along the way, he will share his philosophy with young entrepreneurs all over the globe. At 29, Ohanian has come to personify the dorm-room tech entrepreneur, changing the world without asking permission. Within a couple of years of graduating from the University of Virginia, Ohanian did just that, selling reddit for millions of dollars. He's gone on to start many other companies, like hipmunk and breadpig, all while representing Y Combinator and investing in over sixty other tech startups. Without Their Permission is his personal guidebook as to how other aspiring entrepreneurs can follow in his footsteps.",
    "image": "http://books.google.com/books/content?id=wSE2AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781455520039.png"
  },
  {
    "title": "Blueprint Your Bestseller",
    "authors": [
      "Stuart Horwitz"
    ],
    "isbn": "9780399162152",
    "edition": "5",
    "genre": "Language Arts & Disciplines",
    "publisher": "National Geographic Books",
    "published_date": "2013-01-29",
    "stock": 41,
    "status": "Checked Out",
    "description": "The first draft is the easy part… In Blueprint Your Bestseller, Stuart Horwitz offers a step-by-step process for revising your manuscript that has helped bestselling authors get from first draft to final draft. Whether you’re tinkering with your first one hundred pages or trying to wrestle a complete draft into shape, Horwitz helps you look at your writing with the fresh perspective you need to reach the finish line. Blueprint Your Bestseller introduces the Book Architecture Method, a tested sequence of steps for organizing and revising any manuscript. By breaking a manuscript into manageable scenes, you can determine what is going on in your writing at the structural level—and uncover the underlying flaws and strengths of your narrative. For more than a decade this proven approach to revision has helped authors of both fiction and nonfiction, as well as writers across all media from theater to film to TV.",
    "image": "http://books.google.com/books/content?id=oGqNEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9780399162152.png"
  },
  {
    "title": "The Bestseller",
    "authors": [
      "Olivia Goldsmith"
    ],
    "isbn": "9781626814394",
    "edition": "5",
    "genre": "Fiction",
    "publisher": "Diversion Publishing Corp.",
    "published_date": "2014-10-14",
    "stock": 44,
    "status": "Reserved",
    "description": "From a New York Times–bestselling author, comes this “highly entertaining tale [with] considerable humor and some cynical fun at the expense of the book business” (Publishers Weekly). At Davis & Dash, one of New York’s most prestigious publishing houses, five new authors will be published—but only one of them will be a bestseller. They have worked long and hard to write their novels of romance and murder, drama and love, but the story behind the stories is even more exciting. And the vicious competition to get the right agent, the perfect editor, and the choice spot on the bestseller list must be seen to be believed. From the author of The First Wives Club, this “dishy” novel set in New York’s book publishing industry (Glamour) is a fun behind-the-scenes romp with “lots of romance and revenge” (The Washington Post Book World). “Extremely satisfying.” —The New York Times Book Review",
    "image": "http://books.google.com/books/content?id=YpvNBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781626814394.png"
  },
  {
    "title": "The Bestseller Code",
    "authors": [
      "Jodie Archer",
      "Matthew L. Jockers"
    ],
    "isbn": "9781250088284",
    "edition": "2",
    "genre": "Language Arts & Disciplines",
    "publisher": "St. Martin's Press",
    "published_date": "2016-09-20",
    "stock": 22,
    "status": "Reserved",
    "description": "\"When a story captures the imagination of millions, that's magic. Can you qualify magic? Archer and Jockers just may have done so.\"—Sylvia Day, New York Times bestselling author Ask most people about massive success in the world of fiction, and you’ll typically hear that it’s a game of hazy crystal balls. The sales figures of E. L. James or Dan Brown seem to be freakish—random occurrences in an unknowable market. But what if there were an algorithm that could reveal a secret DNA of bestsellers, regardless of their genre? What if it knew, just from analyzing the words alone, not just why genre writers like John Grisham and Danielle Steel belong on the lists, but also that authors such as Junot Diaz, Jodi Picoult, and Donna Tartt had telltale signs of success all over their pages? Thanks to Jodie Archer and Matthew Jockers, the algorithm exists, the code has been cracked, and the results bring fresh new insights into how fiction works and why we read. The Bestseller Code offers a new theory for why Fifty Shades of Grey sold so well. It sheds light on the current craze for dark heroines. It reveals which themes tend to sell best. And all with fascinating supporting data taken from a five-year study of twenty thousand novels. Then there is the hunt for \"the one\"—the paradigmatic example of bestselling writing according to a computer's analysis of thousands of points of data. The result is surprising, a bit ironic, and delightfully unorthodox. This book explains groundbreaking text-mining research in accessible terms and offers a new perspective on the New York Times bestseller list. It's a big-idea book about the relationship between creativity and technology that will be provocative to anyone interested in how analytics have already transformed the worlds of finance, medicine, and sports. But at heart it is a celebration of books for readers and writers—a compelling investigation into how successful writing works, and a fresh take on our intellectual and emotional response to stories.",
    "image": "http://books.google.com/books/content?id=F4JzCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781250088284.png"
  },
  {
    "title": "Yes I Can",
    "authors": [
      "Sammy Davis",
      "Jane Boyar",
      "Burt Boyar"
    ],
    "isbn": "9780374522681",
    "edition": "1",
    "genre": "African American entertainers",
    "publisher": "Farrar Straus & Giroux",
    "published_date": "1990",
    "stock": 17,
    "status": "Reserved",
    "description": "The popular entertainer describes the major events of his life up to the time of his marriage to May Britt.",
    "image": "http://books.google.com/books/content?id=xY3fwAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9780374522681.png"
  },
  {
    "title": "Do What You Said You Would Do",
    "authors": [
      "Jim Jordan"
    ],
    "isbn": "9781637581469",
    "edition": "5",
    "genre": "Political Science",
    "publisher": "Simon and Schuster",
    "published_date": "2021-11-23",
    "stock": 39,
    "status": "Available",
    "description": "Get an inside look at the detailed investigations of the United States Congress, the groundwork for Donald Trump’s win in 2016, and the events that occurred during his successful four years as president. When I woke up on October 2, 2020, I figured it would be like most Fridays in DC. Congress would finish up the week with a few votes on the House Floor and then members would rush to Reagan National Airport to catch a flight home. Polly and I had a mid-afternoon flight; however, we weren’t headed home. We were going to Wisconsin to help a colleague raise funds and to attend the President’s rally in Green Bay…. As I started to put on my workout gear before heading to the House gym, I took a look at my phone. I noticed I had several text messages and missed phone calls from Russell Dye, the top media staffer for our personal office and for Republicans on the House Judiciary Committee. Some of the calls and messages were from after midnight…. I called him right away. “What’s going on?” I asked. He responded, “Sir, the president has the virus!” I turned on the TV. It was the only story.… I had traveled to Cleveland with the president three days earlier—I knew I’d have to quarantine until I got tested. I’d been tested before the flight to Cleveland, but that wouldn’t matter now. I’d have to get a new test. No workout this morning, no flight to Wisconsin this afternoon…. First things first. I was scheduled for a Fox and Friends interview that morning in the eight o’clock hour. I grabbed a quick shower and then headed to the office to prep for the interview. We were supposed to discuss the election and how the president was doing in Ohio. But we knew the only topic would be the president contracting the virus…. An hour later I got tested in the House physician’s office.… On that drive home Polly and I talked about all that had transpired that morning. We talked about the president and first lady, and like millions of other Americans, we prayed for their health and for our country. Over the weekend I thought about that day—that one day—Friday, October 2, 2020: it was really a picture of the entire year. 2020 was about the virus and the presidential election. 2020 was all about politics.",
    "image": "http://books.google.com/books/content?id=fHk8EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781637581469.png"
  },
  {
    "title": "Space, Place, and Bestsellers",
    "authors": [
      "Lisa Fletcher",
      "Elizabeth Leane"
    ],
    "isbn": "9781108856713",
    "edition": "3",
    "genre": "Language Arts & Disciplines",
    "publisher": "Cambridge University Press",
    "published_date": "2024-06-30",
    "stock": 40,
    "status": "Checked Out",
    "description": "From airport bookstores to deckchairs, as audiobooks downloaded by commuters, and on Kindles and other portable devices, twenty-first century bestsellers move in old and new ways. This Element examines the locations and mobilities of the contemporary bestseller as a multi-format commercial object. It employs paratextual, textual, and site-based analysis of the spatiality of bestsellers and considers the centrality of geography to the commercial promise of these books. Space, Place, and Bestsellers provides analysis of the spatial logic of bestseller lists, evidence-rich accounts of the physical and digital retail sites through which bestsellers flow, and new interpretations of how affixing the label 'bestseller' individual authors and titles generates industrial, social, and textual effects. Through its multi-layered analysis, this Element offers a new model for studying the spatiality of popular fiction.",
    "image": "http://books.google.com/books/content?id=p5oKEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781108856713.png"
  },
  {
    "title": "The Way of Kings",
    "authors": [
      "Brandon Sanderson"
    ],
    "isbn": "9781429992800",
    "edition": "4",
    "genre": "Fiction",
    "publisher": "Tor Books",
    "published_date": "2010-08-31",
    "stock": 21,
    "status": "Available",
    "description": "From #1 New York Times bestselling author Brandon Sanderson, The Way of Kings, Book One of the Stormlight Archive, begins an incredible new saga of epic proportion. Roshar is a world of stone and storms. Uncanny tempests of incredible power sweep across the rocky terrain so frequently that they have shaped ecology and civilization alike. Animals hide in shells, trees pull in branches, and grass retracts into the soilless ground. Cities are built only where the topography offers shelter. It has been centuries since the fall of the ten consecrated orders known as the Knights Radiant, but their Shardblades and Shardplate remain: mystical swords and suits of armor that transform ordinary men into near-invincible warriors. Men trade kingdoms for Shardblades. Wars were fought for them, and won by them. One such war rages on a ruined landscape called the Shattered Plains. There, Kaladin, who traded his medical apprenticeship for a spear to protect his little brother, has been reduced to slavery. In a war that makes no sense, where ten armies fight separately against a single foe, he struggles to save his men and to fathom the leaders who consider them expendable. Brightlord Dalinar Kholin commands one of those other armies. Like his brother, the late king, he is fascinated by an ancient text called The Way of Kings. Troubled by over-powering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity. Across the ocean, an untried young woman named Shallan seeks to train under an eminent scholar and notorious heretic, Dalinar's niece, Jasnah. Though she genuinely loves learning, Shallan's motives are less than pure. As she plans a daring theft, her research for Jasnah hints at secrets of the Knights Radiant and the true cause of the war. The result of over ten years of planning, writing, and world-building, The Way of Kings is but the opening movement of the Stormlight Archive, a bold masterpiece in the making. Speak again the ancient oaths: Life before death. Strength before weakness. Journey before Destination. and return to men the Shards they once bore. The Knights Radiant must stand again. Other Tor books by Brandon Sanderson The Cosmere The Stormlight Archive ● The Way of Kings ● Words of Radiance ● Edgedancer (novella) ● Oathbringer ● Dawnshard (novella) ● Rhythm of War The Mistborn Saga The Original Trilogy ● Mistborn ● The Well of Ascension ● The Hero of Ages Wax and Wayne ● The Alloy of Law ● Shadows of Self ● The Bands of Mourning ● The Lost Metal Other Cosmere novels ● Elantris ● Warbreaker ● Tress of the Emerald Sea ● Yumi and the Nightmare Painter ● The Sunlit Man Collection ● Arcanum Unbounded: The Cosmere Collection The Alcatraz vs. the Evil Librarians series ● Alcatraz vs. the Evil Librarians ● The Scrivener's Bones ● The Knights of Crystallia ● The Shattered Lens ● The Dark Talent ● Bastille vs. the Evil Librarians (with Janci Patterson) Other novels ● The Rithmatist ● Legion: The Many Lives of Stephen Leeds ● The Frugal Wizard’s Handbook for Surviving Medieval England Other books by Brandon Sanderson The Reckoners ● Steelheart ● Firefight ● Calamity Skyward ● Skyward ● Starsight ● Cytonic ● Skyward Flight (with Janci Patterson) ● Defiant At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
    "image": "http://books.google.com/books/content?id=OHclhBVv-X4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781429992800.png"
  },
  {
    "title": "Bestsellers",
    "authors": [
      "C. Bloom"
    ],
    "isbn": "9780230583870",
    "edition": "2",
    "genre": "Fiction",
    "publisher": "Springer",
    "published_date": "2008-09-29",
    "stock": 38,
    "status": "Reserved",
    "description": "This essential guide, now available in a fully updated new edition, is the only available study of all bestselling books, authors and genres since the start of the last century, giving an unique insight into a hundred years of publishing and reading and taking us on a journey into the heart of the British imagination.",
    "image": "http://books.google.com/books/content?id=CpKFDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780230583870.png"
  },
  {
    "title": "An All-in-One Guide to Become a Bestseller",
    "authors": [
      "Ukiyoto"
    ],
    "isbn": "9789357874717",
    "edition": "1",
    "genre": "Fiction",
    "publisher": "Ukiyoto Publishing",
    "published_date": "2023-05-05",
    "stock": 21,
    "status": "Reserved",
    "description": "How do you grab a book publishing deal with a publisher of your dreams? You offer them a potential bestseller they can’t refuse! With “All-in-One Guide to Become a Bestseller,” learn how to write a critically and commercially successful book, build readership loyalty, create the ultimate author platform using social media tools, learn how to sell your author brand, come up with a foolproof launch plan for your book, and manage your expectations as a first-time author!",
    "image": "http://books.google.com/books/content?id=KYy9EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9789357874717.png"
  },
  {
    "title": "Handbook for Mortals",
    "authors": [
      "Lani Sarem"
    ],
    "isbn": "9781545611456",
    "edition": "2",
    "genre": "Young Adult Fiction",
    "publisher": "Geeknation Press",
    "published_date": "2017-08-15",
    "stock": 31,
    "status": "Reserved",
    "description": "\"Zade Holder has always been a free-spirited young woman, from a long dynasty of tarot-card readers, fortunetellers, and practitioners of magick. Growing up in a small town and never quite fitting in, Zade is determined to forge her own path. She leaves her home in Tennessee to break free from her overprotective mother Dela, the local resident spellcaster and fortuneteller. Zade travels to Las Vegas and uses supernatural powers to become part of a premiere magic show led by the infamous magician Charles Spellman. Zade fits right in with his troupe of artists and misfits. After all, when everyone is slightly eccentric, appearing 'normal' is much less important. Behind the scenes of this multimillion-dollar production, Zade finds herself caught in a love triangle with Mac, the show's good-looking but rough-around-the-edges technical director and Jackson, the tall, dark, handsome and charming bandleader. Zade's secrets and the struggle to choose between Mac or Jackson creates reckless tension during the grand finale of the show. Using Chaos magick, which is known for being unpredictable, she tests her abilities as a spellcaster farther than she's ever tried and finds herself at death's door. Her fate is left in the hands of a mortal who does not believe in a world of real magick, a fortuneteller who knew one day Zade would put herself in danger and a dagger with mystical powers\"--Amazon.com",
    "image": "http://books.google.com/books/content?id=bTR1swEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9781545611456.png"
  },
  {
    "title": "The Accidental Bestseller",
    "authors": [
      "Wendy Wax"
    ],
    "isbn": "9780515148077",
    "edition": "1",
    "genre": "Fiction",
    "publisher": "Jove Publications",
    "published_date": "2010-05-25",
    "stock": 48,
    "status": "Checked Out",
    "description": "Ten years after meeting at a writing conference, four friends including a successful workaholic, an overwhelmed single mom, a televangelist's wife, and a slumping author, gather in a mountain cabin where they collaborate on a novel that becomes an unexpected hit.",
    "image": "http://books.google.com/books/content?id=kN9XmAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9780515148077.png"
  },
  {
    "title": "The Lost Symbol",
    "authors": [
      "Dan Brown"
    ],
    "isbn": "9780385533133",
    "edition": "2",
    "genre": "Fiction",
    "publisher": "Vintage",
    "published_date": "2009-09-15",
    "stock": 10,
    "status": "Available",
    "description": "THE #1 WORLDWIDE BESTSELLER FROM THE ICONIC AUTHOR OF THE DA VINCI CODE “Impossible to put down.” —The New York Times “Thrilling and entertaining, like the experience on a roller coaster.” —Los Angeles Times Famed Harvard symbologist Robert Langdon answers an unexpected summons to deliver a lecture at the U.S. Capitol Building. His plans are interrupted when a disturbing object—artfully encoded with five symbols—is discovered in the building. Langdon recognizes in the find an ancient invitation into a lost world of esoteric, potentially dangerous wisdom. When his mentor, Peter Solomon—a long-standing Mason and beloved philanthropist—is kidnapped, Langdon realizes that the only way to save Solomon is to accept the mystical invitation and plunge headlong into a clandestine world of Masonic secrets, hidden history, and one inconceivable truth . . . all under the watchful eye of a terrifying enemy. Robert Langdon returns in Inferno, Origin, and The Secret of Secrets (coming soon)!",
    "image": "http://books.google.com/books/content?id=ucpxOA3LDWcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780385533133.png"
  },
  {
    "title": "The People’s Princess",
    "authors": [
      "Flora Harding"
    ],
    "isbn": "9780008446932",
    "edition": "5",
    "genre": "Fiction",
    "publisher": "HarperCollins UK",
    "published_date": "2022-03-31",
    "stock": 48,
    "status": "Available",
    "description": "Step behind the palace doors in this gripping historical novel that is a must read for fans of The Crown and Princess Diana!",
    "image": "http://books.google.com/books/content?id=ulsjEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780008446932.png"
  },
  {
    "title": "Bestsellers (Routledge Revivals)",
    "authors": [
      "John Sutherland"
    ],
    "isbn": "9781136830631",
    "edition": "3",
    "genre": "Literary Criticism",
    "publisher": "Routledge",
    "published_date": "2010-10-04",
    "stock": 11,
    "status": "Checked Out",
    "description": "First published in 1981, this book offers a study of British and American popular fiction in the 1970s, a decade in which the quest for the superseller came to dominate the lives of publishers on both sides of the Atlantic. Illustrated by examples of the lurid incidents that catapult so many books into the bestseller charts, this comprehensive study covers the work of Robbins, Hailey and Maclean, the 'bodice rippers', the disaster craze, horror, war stories and media tie-ins such as The Godfather, Jaws and Star Wars.",
    "image": "http://books.google.com/books/content?id=2gOsAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781136830631.png"
  },
  {
    "title": "The Alchemist - 10th Anniversary Edition",
    "authors": [
      "Paulo Coelho"
    ],
    "isbn": "9780061741241",
    "edition": "4",
    "genre": "Fiction",
    "publisher": "Harper Collins",
    "published_date": "2009-10-13",
    "stock": 50,
    "status": "Available",
    "description": "\"My heart is afraid that it will have to suffer,\" the boy told the alchemist one night as they looked up at the moonless sky.\" Tell your heart that the fear of suffering is worse than the suffering itself. And that no heart has ever suffered when it goes in search of its dreams.\" Every few decades a book is published that changes the lives of its readers forever. The Alchemist is such a book. With over a million and a half copies sold around the world, The Alchemist has already established itself as a modern classic, universally admired. Paulo Coelho's charming fable, now available in English for the first time, will enchant and inspire an even wider audience of readers for generations to come. The Alchemist is the magical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure as extravagant as any ever found. From his home in Spain he journeys to the markets of Tangiers and across the Egyptian desert to a fateful encounter with the alchemist. The story of the treasures Santiago finds along the way teaches us, as only a few stories have done, about the essential wisdom of listening to our hearts, learning to read the omens strewn along life's path, and, above all, following our dreams.",
    "image": "http://books.google.com/books/content?id=FEL8DlqjYEkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780061741241.png"
  },
  {
    "title": "The Bestseller",
    "authors": [
      "Olivia Goldsmith"
    ],
    "isbn": "9780061096082",
    "edition": "5",
    "genre": "Fiction",
    "publisher": "HarperTorch",
    "published_date": "1997-06-14",
    "stock": 41,
    "status": "Checked Out",
    "description": "At Davis & Dash, one of New York's most prestigious publishing houses, five new authors will be published--but only one of them will be a bestseller. They have worked long and hard to write their novels of romance and murder, drama and love. But the story behind the stories is even more exciting. And the vicious competition to get the right agent, the perfect editor, and the choice spot on the bestseller list must be seen to be believed.",
    "image": "http://books.google.com/books/content?id=Su9r8_7gapUC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9780061096082.png"
  },
  {
    "title": "Bestsellers: Popular Fiction Since 1900",
    "authors": [
      "Clive Bloom"
    ],
    "isbn": "9783030791544",
    "edition": "4",
    "genre": "Fiction",
    "publisher": "Springer Nature",
    "published_date": "2022-01-03",
    "stock": 9,
    "status": "Reserved",
    "description": "This book charts the publishing industry and bestselling fiction from 1900, featuring a comprehensive list of all bestselling fiction titles in the UK. This third edition includes a new introduction which features additional information on current trends in reading including the rise of Black, Asian and LGBTQIA+ publishing; the continuing importance of certain genres and up to date trends in publishing, bookselling, library borrowing and literacy. There are sections on writing for children, on the importance of audiobooks and book clubs, self- published bestsellers as well as many new entries to the present day including bestselling authors such as David Walliams, Peter James, George R R Martin and far less well known authors whose books s sell in their thousands. This is the essential guide to best-selling books, authors, genres, publishing and bookselling since 1900, providing a unique insight into more than a century of entertainment, and opening a window into the reading habits and social life of the British from the death of Queen Victoria to the Coronavirus Pandemic.",
    "image": "http://books.google.com/books/content?id=aptXEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9783030791544.png"
  },
  {
    "title": "House of Leaves",
    "authors": [
      "Mark Z. Danielewski"
    ],
    "isbn": "9780375703768",
    "edition": "5",
    "genre": "Fiction",
    "publisher": "Pantheon",
    "published_date": "2000",
    "stock": 21,
    "status": "Available",
    "description": "THE MIND-BENDING CULT CLASSIC ABOUT A HOUSE THAT’S LARGER ON THE INSIDE THAN ON THE OUTSIDE • A masterpiece of horror and an astonishingly immersive, maze-like reading experience that redefines the boundaries of a novel. ''Simultaneously reads like a thriller and like a strange, dreamlike excursion into the subconscious.\" —Michiko Kakutani, The New York Times \"Thrillingly alive, sublimely creepy, distressingly scary, breathtakingly intelligent—it renders most other fiction meaningless.\" —Bret Easton Ellis, bestselling author of American Psycho “This demonically brilliant book is impossible to ignore.” —Jonathan Lethem, award-winning author of Motherless Brooklyn One of The Atlantic’s Great American Novels of the Past 100 Years Years ago, when House of Leaves was first being passed around, it was nothing more than a badly bundled heap of paper, parts of which would occasionally surface on the Internet. No one could have anticipated the small but devoted following this terrifying story would soon command. Starting with an odd assortment of marginalized youth—musicians, tattoo artists, programmers, strippers, environmentalists, and adrenaline junkies—the book eventually made its way into the hands of older generations, who not only found themselves in those strangely arranged pages but also discovered a way back into the lives of their estranged children. Now made available in book form, complete with the original colored words, vertical footnotes, and second and third appendices, the story remains unchanged. Similarly, the cultural fascination with House of Leaves remains as fervent and as imaginative as ever. The novel has gone on to inspire doctorate-level courses and masters theses, cultural phenomena like the online urban legend of “the backrooms,” and incredible works of art in entirely unrealted mediums from music to video games. Neither Pulitzer Prize-winning photojournalist Will Navidson nor his companion Karen Green was prepared to face the consequences of the impossibility of their new home, until the day their two little children wandered off and their voices eerily began to return another story—of creature darkness, of an ever-growing abyss behind a closet door, and of that unholy growl which soon enough would tear through their walls and consume all their dreams.",
    "image": "http://books.google.com/books/content?id=o6NzGNODRjkC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9780375703768.png"
  },
  {
    "title": "Jane's Patisserie",
    "authors": [
      "Jane Dunn"
    ],
    "isbn": "9781728291802",
    "edition": "2",
    "genre": "Cooking",
    "publisher": "Sourcebooks",
    "published_date": "2024-02-06",
    "stock": 36,
    "status": "Reserved",
    "description": "From #1 Sunday Times bestselling author and food blogger, Jane Dunn, Jane's Patisserie is your go-to dessert recipe cookbook, with 100 delicious bakes, cakes, and sweet treats, loved for being easy, customizable, and packed with everyone's favorite flavors. Discover how to make life sweet with 100 delicious bakes, cakes, cookies, rolls, and treats from baking blogger, Jane Dunn. Jane's recipes are loved for being easy, customizable, and packed with your favorite flavors. Covering everything from gooey cookies and celebration cakes with a dreamy drip finish, to fluffy cupcakes and creamy no-bake cheesecakes, Jane's Patisserie is easy baking for everyone. Yummy recipes include: NYC Chocolate Chip Cookies No-Bake Biscoff Cheesecake Salted Caramel Dip Cookies & Cream Drip Cake Cinnamon Rolls Triple Chocolate Brownies Whether you're looking for a salted caramel fix or a spicy biscoff bake, this book has everything you need to create iconic bakes and become a star baker.",
    "image": "http://books.google.com/books/content?id=73TZzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9781728291802.png"
  },
  {
    "title": "Hillbilly Elegy",
    "authors": [
      "J D Vance"
    ],
    "isbn": "9780063438354",
    "edition": "1",
    "genre": "Biography & Autobiography",
    "publisher": "Harper Large Print",
    "published_date": "2024-10",
    "stock": 42,
    "status": "Reserved",
    "description": "Hillbilly Elegy recounts J.D. Vance's powerful origin story... From a former marine and Yale Law School graduate now serving as a U.S. Senator from Ohio and the Republican Vice Presidential candidate for the 2024 election, an incisive account of growing up in a poor Rust Belt town that offers a broader, probing look at the struggles of America's white working class. THE #1 NEW YORK TIMES BESTSELLER \"You will not read a more important book about America this year.\"--The Economist \"A riveting book.\"--The Wall Street Journal \"Essential reading.\"--David Brooks, New York Times Hillbilly Elegy is a passionate and personal analysis of a culture in crisis--that of white working-class Americans. The disintegration of this group, a process that has been slowly occurring now for more than forty years, has been reported with growing frequency and alarm, but has never before been written about as searingly from the inside. J. D. Vance tells the true story of what a social, regional, and class decline feels like when you were born with it hung around your neck. The Vance family story begins hopefully in postwar America. J. D.'s grandparents were \"dirt poor and in love,\" and moved north from Kentucky's Appalachia region to Ohio in the hopes of escaping the dreadful poverty around them. They raised a middle-class family, and eventually one of their grandchildren would graduate from Yale Law School, a conventional marker of success in achieving generational upward mobility. But as the family saga of Hillbilly Elegy plays out, we learn that J.D.'s grandparents, aunt, uncle, and, most of all, his mother struggled profoundly with the demands of their new middle-class life, never fully escaping the legacy of abuse, alcoholism, poverty, and trauma so characteristic of their part of America. With piercing honesty, Vance shows how he himself still carries around the demons of his chaotic family history. A deeply moving memoir, with its share of humor and vividly colorful figures, Hillbilly Elegy is the story of how upward mobility really feels. And it is an urgent and troubling meditation on the loss of the American dream for a large segment of this country.",
    "image": "http://books.google.com/books/content?id=d_jT0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9780063438354.png"
  },
  {
    "title": "Hype",
    "authors": [
      "Jon Helgason",
      "Sara Kärrholm",
      "Ann Steiner"
    ],
    "isbn": "9789187675324",
    "edition": "2",
    "genre": "Literary Criticism",
    "publisher": "Nordic Academic Press",
    "published_date": "2015-01-01",
    "stock": 20,
    "status": "Available",
    "description": "In the world of books and literature, “hype” is associated with bestsellerism - the books that sell the most, are read by vast numbers, and constantly talked about in media and staff rooms. Often, it is the success in itself that generates an interest because popularity begets popularity. Quite often though, a hyped bestseller is met with a skeptic criticism of poor language, a badly constructed plot, a predictable story line, or all three. The bestseller phenomenon is sometimes conceived as a threat against “real” literature. Research into the creation, reception, and meaning of bestsellers is utterly scarce and Hype: Bestsellers and Literary Culture is an important contribution to the understanding of the literature read by the masses. Popular literature plays an important role in the lives of millions of readers, offering entertainment, social commentary, and alternate perspectives on everyday life. This volume brings together such diverse issues as the creation of hype, the role and the meaning of the author in the present-day media landscape, changes in the book trade, and the relationship between bestsellers and research into them. Further articles give an historical overview on postapocalyptic stories, desert romances and the role of the authors. This book offers new knowledge on a subject that is increasingly popular within university curricula. Although the anthology is a work of academic research the texts are of equal interest to general readers.",
    "image": "http://books.google.com/books/content?id=m4yBEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9789187675324.png"
  },
  {
    "title": "Bestsellers of the Third Reich",
    "authors": [
      "Christian Adam"
    ],
    "isbn": "9781800730403",
    "edition": "5",
    "genre": "History",
    "publisher": "Berghahn Books",
    "published_date": "2021-04-01",
    "stock": 45,
    "status": "Available",
    "description": "Despite the displacement of countless authors, frequent bans of specific titles, and high-profile book burnings, the German book industry boomed during the Nazi period. Notwithstanding the millions of copies of Mein Kampf that were sold, the era’s most popular books were diverse and often surprising in retrospect, despite an oppressive ideological and cultural climate: Huxley’s Brave New World was widely read in the 1930s, while Saint-Exupéry’s Wind, Sand and Stars was a great success during the war years. Bestsellers of the Third Reich surveys this motley collection of books, along with the circumstances of their publication, to provide an innovative new window into the history of Nazi Germany.",
    "image": "http://books.google.com/books/content?id=86cDEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781800730403.png"
  },
  {
    "title": "Pulp",
    "authors": [
      "Scott McCracken"
    ],
    "isbn": "9780719047596",
    "edition": "5",
    "genre": "Fiction",
    "publisher": "Manchester University Press",
    "published_date": "1998-09-15",
    "stock": 36,
    "status": "Available",
    "description": "Bringing together chapters on the bestseller, detective fiction, popular romance, science fiction and horror, this text provides an account of the cultural theories that have informed the study of popular fiction.",
    "image": "http://books.google.com/books/content?id=wVNWTrtfv_UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780719047596.png"
  },
  {
    "title": "Cultural Capitalism",
    "authors": [
      "Bradley A. Gorski"
    ],
    "isbn": "9781501779800",
    "edition": "4",
    "genre": "History",
    "publisher": "Cornell University Press",
    "published_date": "2025-03-15",
    "stock": 29,
    "status": "Reserved",
    "description": "Cultural Capitalism explores Russian literature's eager embrace of capitalism in the post-Soviet era. When the Soviet Union fell, books were suddenly bought and sold as commodities. Russia's first bestseller lists brought attention and prestige. Even literary prizes turned to the market for legitimacy. The rise of capitalism entirely transformed both the economics and the aesthetics of Russian literature. By reconstructing the market's influence on everything from late-Soviet paper shortages to the prose of neoimperialism, Cultural Capitalism reveals Russian literature's exuberant hopes for and deep disappointments in capitalism. Only a free market, it was hoped, could cure endemic book deficits and liberate literature from ideological constraints. But as the market came to dominate literature, it imposed an ideology of its own, one that directed literary development for decades. Through archival research, original interviews, and provocative readings of literary texts, Bradley A. Gorski immerses the reader in both the economic and aesthetic worlds of post-Soviet Russian literature to reveal a cultural logic dominated by capitalism. The Russian 1990s and early 2000s saw markets introduced, adopted, and debated at an accelerated pace, all against the backdrop of a socialist past, staging the polemics between capitalism and culture in high drama and sharp relief. But the market forces at the center of the post-Soviet transition are fundamental to cultural trends worldwide. By revealing the complexities of Russia's story, Cultural Capitalism mounts a critique that cuts across national borders and provides a new way of seeing culture in the post-1989 era worldwide.",
    "image": "http://books.google.com/books/content?id=d_wvEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781501779800.png"
  },
  {
    "title": "What Readers Do",
    "authors": [
      "Beth Driscoll"
    ],
    "isbn": "9781350375154",
    "edition": "4",
    "genre": "Literary Criticism",
    "publisher": "Bloomsbury Publishing",
    "published_date": "2024-02-21",
    "stock": 42,
    "status": "Checked Out",
    "description": "Shining a spotlight on everyday readers of the 21st century, Beth Driscoll explores how contemporary readers of Anglophone fiction interact with the book industry, digital environments, and each other. We live in an era when book clubs, bibliomemoirs, Bookstagram and BookTok are as valuable to some readers as solitary reading moments. The product of nearly two decades of qualitative research into readers and reading culture, What Readers Do examines reading through three dimensions - aesthetic conduct, moral conduct, and self-care \u0096 to show how readers intertwine private and social behaviors, and both reinforce and oppose the structures of capitalism. Analyzing reading as a post-digital practice that is a synthesis of both print and digital modes and on- and offline behaviors, Driscoll presents a methodology for studying readers that connects book history, literary studies, sociology, and actor-network theory. Arguing for the vitality, agency, and creativity of readers, this book sheds light on how we read now - and on how much more readers do than just read.",
    "image": "http://books.google.com/books/content?id=A6fuEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781350375154.png"
  },
  {
    "title": "Publicize Your Book!",
    "authors": [
      "Jacqueline Deval"
    ],
    "isbn": "9780399528637",
    "edition": "4",
    "genre": "Reference",
    "publisher": "Penguin",
    "published_date": "2003",
    "stock": 0,
    "status": "Reserved",
    "description": "More information to be announced soon on this forthcoming title from Penguin USA",
    "image": "http://books.google.com/books/content?id=OcgRyxqvjYMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780399528637.png"
  },
  {
    "title": "Row the Boat",
    "authors": [
      "Jon Gordon",
      "P.J. Fleck"
    ],
    "isbn": "9781119766308",
    "edition": "3",
    "genre": "Business & Economics",
    "publisher": "John Wiley & Sons",
    "published_date": "2021-05-04",
    "stock": 45,
    "status": "Available",
    "description": "Learn to live and lead with enthusiasm and optimism, impact your team, and transform your culture In Row the Boat, Minnesota Golden Gophers Head Coach P.J. Fleck and bestselling author Jon Gordon deliver an inspiring message about what you can achieve when you approach life with a never-give-up philosophy. The book shows you how to choose enthusiasm and optimism as your guiding lights instead of being defined by circumstances and events outside of your control. Discover how to put the three key components of row the boat into practice in your life: The Oar: The energy. Only you can dictate whether your oar is in the water or whether you take it out and decide not to use it. The Boat: The sacrifice. The more you give, serve, and make your life about helping others, the better and more fulfilled your life will be, and the bigger your boat gets. The Compass: The direction. The vision you have for your life and the people you surround yourself with help create the dream of where you want to go. Perfect for athletes, coaches, business leaders, and anyone else who hopes to squeeze a little more enjoyment and productivity out of life, Row the Boat will propel leaders, teams, and organizations to greater heights than they have ever reached before.",
    "image": "http://books.google.com/books/content?id=vsAsEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781119766308.png"
  },
  {
    "title": "The Publishing Business",
    "authors": [
      "Kelvin Smith",
      "Melanie Ramdarshan Bold"
    ],
    "isbn": "9781474249522",
    "edition": "5",
    "genre": "Business & Economics",
    "publisher": "Bloomsbury Publishing",
    "published_date": "2018-02-22",
    "stock": 27,
    "status": "Checked Out",
    "description": "The Publishing Business, is an invaluable guide to understanding what book publishing is and what it might become. Using popular and current examples, this second edition demonstrates that, to succeed, publishers must prove their commitment to producing accurate, attractive and well edited content, their ability to innovate pioneering digital technologies and their dedication to promoting their titles to new audiences. This book explains the responsibilities at each stage of the publishing process, describes current roles and practices, and provides much food for thought on how publishers can ensure their skills remain relevant in the digital age. Fully updated to take into account recent developments in the publishing world, this new edition also includes additional real-world examples from a variety of publishing sectors, insightful interviews with industry experts and new and updated activities throughout. Beautifully designed, thoroughly illustrated and packed with examples of publishing practice, The Publishing Business is an essential introduction to a dynamic industry.",
    "image": "http://books.google.com/books/content?id=WdLsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781474249522.png"
  },
  {
    "title": "The Garden",
    "authors": [
      "Jon Gordon"
    ],
    "isbn": "9781119430667",
    "edition": "3",
    "genre": "Business & Economics",
    "publisher": "John Wiley & Sons",
    "published_date": "2020-05-21",
    "stock": 43,
    "status": "Available",
    "description": "From bestselling author Jon Gordon comes a spiritual fable about the power of faith, hope, and love Meet Jay and Kay. They’re twins, and like many teenagers their age, they’re dealing with stress and anxiety. One day on their way to school, they have a nice conversation with their old family friend and youth soccer coach, Mr. Erwin, who shows them a special garden he created in his backyard. The garden serves as both a place and a metaphor for Mr. Erwin to share a powerful paradigm and practical strategies to help the twins overcome their fear, stress, and anxiety. The Garden is an enlightening and encouraging spiritual fable that reveals the 5 D’s that can sabotage us and a proven plan to help us overcome and win the battle in our mind. Rooted in Jon Gordon’s faith tradition, this fable is a different kind of book than his previous business fables. However, in his familiar trademark style, he takes a complex subject and simplifies it to help people take action and improve their lives. Everyone will struggle with fear, anxiety, or stress at some point in their lives, and everyone will have to overcome these challenges to create the life they were meant to live. Given that there are many contributing factors that influence how we think and feel, Jon wrote this book to share how the power of love, encouragement, truth, faith, and belief can be part of the solution. Having worked with countless leaders, companies, sports teams, professional athletes, and high school students, Jon Gordon infuses this life-changing story with thought-provoking ideas, practical strategies, and a framework to overcome fear with faith. Whether you are dealing with fear, stress, and anxiety yourself, have a family member that struggles, or are a mental health expert that works with clients, if any of the ideas in this book can be useful to you or the people you love and care about, then it’s worth a walk through The Garden with Jay, Kay, and Mr. Erwin to discover ways to persevere through life with the power of faith, hope, and love.",
    "image": "http://books.google.com/books/content?id=oDXnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781119430667.png"
  },
  {
    "title": "Prizing Children's Literature",
    "authors": [
      "Kenneth B. Kidd",
      "Joseph T. Thomas Jr."
    ],
    "isbn": "9781317231424",
    "edition": "3",
    "genre": "Literary Criticism",
    "publisher": "Taylor & Francis",
    "published_date": "2016-11-10",
    "stock": 18,
    "status": "Reserved",
    "description": "Children's book awards have mushroomed since the early twentieth-century and especially since the 1960s, when literary prizing became a favored strategy for both commercial promotion and canon-making. There are over 300 awards for English-language titles alone, but despite the profound impact of children’s book awards, scholars have paid relatively little attention to them. This book is the first scholarly volume devoted to the analysis of Anglophone children's book awards in historical and cultural context. With attention to both political and aesthetic concerns, the book offers original and diverse scholarship on prizing practices and their consequences in Australia, Canada, and especially the United States. Contributors offer both case studies of particular awards and analysis of broader trends in literary evaluation and elevation, drawing on theoretical work on canonization and cultural capital. Sections interrogate the complex and often unconscious ideological work of prizing, the ongoing tension between formalist awards and so-called identity-based awards — all the more urgent in light of the \"We Need Diverse Books\" campaign — the ever-morphing forms and parameters of prizing, and scholarly practices of prizing. Among the many awards discussed are the Pura Belpré Medal, the Inky Awards, the Canada Governor General Literary Award, the Printz Award, the Best Animated Feature Oscar, the Phoenix Award, and the John Newbery Medal, giving due attention to prizes for fiction as well as for non-fiction, poetry, and film. This volume will interest scholars in literary and cultural studies, social history, book history, sociology, education, library and information science, and anyone concerned with children's literature.",
    "image": "http://books.google.com/books/content?id=PCMlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781317231424.png"
  },
  {
    "title": "The Fashion Strategy",
    "authors": [
      "Miguel Hebrero"
    ],
    "isbn": "9781370648078",
    "edition": "3",
    "genre": "Business & Economics",
    "publisher": "Miguel Hebrero",
    "published_date": "2017-11-03",
    "stock": 20,
    "status": "Available",
    "description": "Why do some fashion organizations succeed and others don’t? How do the best fashion brands achieve long lasting success? What do the best fashion companies do that set them apart? Why some companies make it to the top only to go bankrupt a few years later? Is fashion dying? Some seem to think so. Or is it merely a matter of mismanagement? Ralph Lauren closed his flagship Polo store. But Amancio Ortega’s fashion empire is still strong, making him one of the richest men in the entire world across all industries. In this book, we will examine what makes a great fashion company and brand. We look at five key dynamics from various perspectives: • Leadership • Problem solving • Vision • How we see our people • Building creativity and innovation There is no magic bullet that solves everything. There is no overnight success. But there are tested techniques that, when used consistently, build the momentum of an organization until it is unstoppable. It takes a certain amount of toughness to get there, and Michael Kors said it best, “fashion is not for sissies.” Collaborators include: Albert Puyol - CEO - LVMH, Women'secret, Brownie Nikhil Nathwani - Retail Director - CH Carolina Herrera, Swarovski, The Body Shop Camilla Amalie Wildfang - Design Manager - Bestseller HK Limited",
    "image": "http://books.google.com/books/content?id=QzVCDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781370648078.png"
  },
  {
    "title": "Dear Appalachia",
    "authors": [
      "Emily Satterwhite"
    ],
    "isbn": "9780813130101",
    "edition": "4",
    "genre": "Literary Criticism",
    "publisher": "University Press of Kentucky",
    "published_date": "2011-10-01",
    "stock": 32,
    "status": "Checked Out",
    "description": "Much criticism has been directed at negative stereotypes of Appalachia perpetuated by movies, television shows, and news media. Books, on the other hand, often draw enthusiastic praise for their celebration of the simplicity and authenticity of the Appalachian region. Dear Appalachia: Readers, Identity, and Popular Fiction since 1878 employs the innovative new strategy of examining fan mail, reviews, and readers’ geographic affiliations to understand how readers have imagined the region and what purposes these imagined geographies have served for them. As Emily Satterwhite traces the changing visions of Appalachia across the decades, from the Gilded Age (1865–1895) to the present, she finds that every generation has produced an audience hungry for a romantic version of Appalachia. According to Satterwhite, best-selling fiction has portrayed Appalachia as a distinctive place apart from the mainstream United States, has offered cosmopolitan white readers a sense of identity and community, and has engendered feelings of national and cultural pride. Thanks in part to readers’ faith in authors as authentic representatives of the regions they write about, Satterwhite argues, regional fiction often plays a role in creating and affirming regional identity. By mapping the geographic locations of fans, Dear Appalachia demonstrates that mobile white readers in particular, including regional elites, have idealized Appalachia as rooted, static, and protected from commercial society in order to reassure themselves that there remains an “authentic” America untouched by global currents. Investigating texts such as John Fox Jr.’s The Trail of the Lonesome Pine (1908), Harriette Arnow’s The Dollmaker (1954), James Dickey’s Deliverance (1970), and Charles Frazier’s Cold Mountain (1997), Dear Appalachia moves beyond traditional studies of regional fiction to document the functions of these narratives in the lives of readers, revealing not only what people have thought about Appalachia, but why.",
    "image": "http://books.google.com/books/content?id=_N4kREK3hpUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780813130101.png"
  },
  {
    "title": "Corporate Compliance and Conformity",
    "authors": [
      "Petter Gottschalk"
    ],
    "isbn": "9781000857085",
    "edition": "2",
    "genre": "Business & Economics",
    "publisher": "Taylor & Francis",
    "published_date": "2023-03-10",
    "stock": 22,
    "status": "Available",
    "description": "Traditionally, control in organizations is concerned with top-down approaches, where executives attempt to direct their employees’ attention, behaviors, and performance to align with the organization’s goals and objectives. This book takes a new approach by turning the problem of control upside down as it focuses on control of executives who find white-collar crime convenient. The bottom-up approach to executive compliance focuses on organizational measures to make white-collar crime less convenient for potential offenders. Rather than focusing on the regulatory formalities and staged procedures of compliance and audits, the book emphasizes the organizational challenges involved in compliance work when trusted corporate officials exhibit deviant behavior, refining, and advancing knowledge in this field by reference to contemporary international case studies and associated original evaluative research. The themes and cases covered are carefully selected to provide the reader with an insight into professional conduct and procedural practice – the organization of corporate compliance success, failure, and corruption – with the theory of convenience placed at the fore. It is the bottom-up approach by application of convenience theory that makes the proposed book unique compared to other books on corporate compliance. This book is a valuable resource for scholars and upper-level students researching and studying in the areas of business administration, organizational behavior, corporate and white-collar crime, as well as business ethics and auditing.",
    "image": "http://books.google.com/books/content?id=24KiEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781000857085.png"
  },
  {
    "title": "Cultural Capitalism",
    "authors": [
      "Bradley A. Gorski"
    ],
    "isbn": "9781501779800",
    "edition": "3",
    "genre": "History",
    "publisher": "Cornell University Press",
    "published_date": "2025-03-15",
    "stock": 39,
    "status": "Checked Out",
    "description": "Cultural Capitalism explores Russian literature's eager embrace of capitalism in the post-Soviet era. When the Soviet Union fell, books were suddenly bought and sold as commodities. Russia's first bestseller lists brought attention and prestige. Even literary prizes turned to the market for legitimacy. The rise of capitalism entirely transformed both the economics and the aesthetics of Russian literature. By reconstructing the market's influence on everything from late-Soviet paper shortages to the prose of neoimperialism, Cultural Capitalism reveals Russian literature's exuberant hopes for and deep disappointments in capitalism. Only a free market, it was hoped, could cure endemic book deficits and liberate literature from ideological constraints. But as the market came to dominate literature, it imposed an ideology of its own, one that directed literary development for decades. Through archival research, original interviews, and provocative readings of literary texts, Bradley A. Gorski immerses the reader in both the economic and aesthetic worlds of post-Soviet Russian literature to reveal a cultural logic dominated by capitalism. The Russian 1990s and early 2000s saw markets introduced, adopted, and debated at an accelerated pace, all against the backdrop of a socialist past, staging the polemics between capitalism and culture in high drama and sharp relief. But the market forces at the center of the post-Soviet transition are fundamental to cultural trends worldwide. By revealing the complexities of Russia's story, Cultural Capitalism mounts a critique that cuts across national borders and provides a new way of seeing culture in the post-1989 era worldwide.",
    "image": "http://books.google.com/books/content?id=d_wvEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781501779800.png"
  },
  {
    "title": "A Christmas Story",
    "authors": [
      "Jean Shepherd"
    ],
    "isbn": "9780307768735",
    "edition": "1",
    "genre": "Fiction",
    "publisher": "Crown",
    "published_date": "2010-10-27",
    "stock": 6,
    "status": "Available",
    "description": "A beloved, bestselling classic of humorous and nostalgic Americana—the book that inspired the equally classic Yuletide film and the live musical on Fox. The holiday film A Christmas Story, first released in 1983, has become a bona fide Christmas perennial, gaining in stature and fame with each succeeding year. Its affectionate, wacky, and wryly realistic portrayal of an American family’s typical Christmas joys and travails in small-town Depression-era Indiana has entered our imagination and our hearts with a force equal to It’s a Wonderful Life and Miracle on 34th Street. This edition of A Christmas Story gathers together in one hilarious volume the gems of autobiographical humor that Jean Shepherd drew upon to create this enduring film. Here is young Ralphie Parker’s shocking discovery that his decoder ring is really a device to promote Ovaltine; his mother and father’s pitched battle over the fate of a lascivious leg lamp; the unleashed and unnerving savagery of Ralphie’s duel in the show with the odious bullies Scut Farkas and Grover Dill; and, most crucially, Ralphie’s unstoppable campaign to get Santa—or anyone else—to give him a Red Ryder carbine action 200-shot range model air rifle. Who cares that the whole adult world is telling him, “You’ll shoot your eye out, kid”? The pieces that comprise A Christmas Story, previously published in the larger collections In God We Trust, All Others Pay Cash and Wanda Hickey’s Night of Golden Memories, coalesce in a magical fashion to become an irresistible piece of Americana, quite the equal of the film in its ability to warm the heart and tickle the funny bone.",
    "image": "http://books.google.com/books/content?id=1moeiUHJo5QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780307768735.png"
  },
  {
    "title": "Marketing For Dummies",
    "authors": [
      "Alexander Hiam"
    ],
    "isbn": "9780470567296",
    "edition": "2",
    "genre": "Business & Economics",
    "publisher": "John Wiley & Sons",
    "published_date": "2009-08-27",
    "stock": 45,
    "status": "Checked Out",
    "description": "Covers everything from essential marketing principles and techniques to the latest methods and trends Want to sharpen your marketing skills to promote your products and services? Whether you're introducing a new product or jumpstarting your existing marketing plans, Marketing For Dummies, 3rd Edition, helps you get a handle on such basic marketing concepts as the four P's-product, pricing, positioning, and placement - and boost your sales with innovative new approaches. Packed with over 25 percent new and revised material, this practical, savvy, guide shows you how to treat every aspect of interacting with customers-including customer service and the product itself - as an opportunity to grow the organization. You'll learn how to prepare hard-hitting campaigns, plan a marketing budget and stick to it, and seize new opportunities to increase customer awareness and appreciation of your product or service. Explains Internet and search engine marketing to work for you Helps you identify customers where you least expect them Offers tips on using online resources to size up competitors Covers effective product positioning in a crowded marketplace Introduces guerilla and global marketing You don't have to be a marketing genius to expand your customer base and boost sales, but you will need a little help from Marketing For Dummies, 3rd Edition.",
    "image": "http://books.google.com/books/content?id=US2WAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780470567296.png"
  },
  {
    "title": "Publicize Your Book!",
    "authors": [
      "Jacqueline Deval"
    ],
    "isbn": "9780399528637",
    "edition": "2",
    "genre": "Reference",
    "publisher": "Penguin",
    "published_date": "2003",
    "stock": 20,
    "status": "Checked Out",
    "description": "More information to be announced soon on this forthcoming title from Penguin USA",
    "image": "http://books.google.com/books/content?id=OcgRyxqvjYMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780399528637.png"
  },
  {
    "title": "Hype",
    "authors": [
      "Jon Helgason",
      "Sara Kärrholm",
      "Ann Steiner"
    ],
    "isbn": "9789187675324",
    "edition": "5",
    "genre": "Literary Criticism",
    "publisher": "Nordic Academic Press",
    "published_date": "2015-01-01",
    "stock": 26,
    "status": "Reserved",
    "description": "In the world of books and literature, “hype” is associated with bestsellerism - the books that sell the most, are read by vast numbers, and constantly talked about in media and staff rooms. Often, it is the success in itself that generates an interest because popularity begets popularity. Quite often though, a hyped bestseller is met with a skeptic criticism of poor language, a badly constructed plot, a predictable story line, or all three. The bestseller phenomenon is sometimes conceived as a threat against “real” literature. Research into the creation, reception, and meaning of bestsellers is utterly scarce and Hype: Bestsellers and Literary Culture is an important contribution to the understanding of the literature read by the masses. Popular literature plays an important role in the lives of millions of readers, offering entertainment, social commentary, and alternate perspectives on everyday life. This volume brings together such diverse issues as the creation of hype, the role and the meaning of the author in the present-day media landscape, changes in the book trade, and the relationship between bestsellers and research into them. Further articles give an historical overview on postapocalyptic stories, desert romances and the role of the authors. This book offers new knowledge on a subject that is increasingly popular within university curricula. Although the anthology is a work of academic research the texts are of equal interest to general readers.",
    "image": "http://books.google.com/books/content?id=m4yBEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9789187675324.png"
  },
  {
    "title": "Row the Boat",
    "authors": [
      "Jon Gordon",
      "P.J. Fleck"
    ],
    "isbn": "9781119766308",
    "edition": "5",
    "genre": "Business & Economics",
    "publisher": "John Wiley & Sons",
    "published_date": "2021-05-04",
    "stock": 12,
    "status": "Reserved",
    "description": "Learn to live and lead with enthusiasm and optimism, impact your team, and transform your culture In Row the Boat, Minnesota Golden Gophers Head Coach P.J. Fleck and bestselling author Jon Gordon deliver an inspiring message about what you can achieve when you approach life with a never-give-up philosophy. The book shows you how to choose enthusiasm and optimism as your guiding lights instead of being defined by circumstances and events outside of your control. Discover how to put the three key components of row the boat into practice in your life: The Oar: The energy. Only you can dictate whether your oar is in the water or whether you take it out and decide not to use it. The Boat: The sacrifice. The more you give, serve, and make your life about helping others, the better and more fulfilled your life will be, and the bigger your boat gets. The Compass: The direction. The vision you have for your life and the people you surround yourself with help create the dream of where you want to go. Perfect for athletes, coaches, business leaders, and anyone else who hopes to squeeze a little more enjoyment and productivity out of life, Row the Boat will propel leaders, teams, and organizations to greater heights than they have ever reached before.",
    "image": "http://books.google.com/books/content?id=vsAsEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781119766308.png"
  },
  {
    "title": "Outsider in the White House",
    "authors": [
      "Senator Bernie Sanders"
    ],
    "isbn": "9781784784188",
    "edition": "2",
    "genre": "Biography & Autobiography",
    "publisher": "Verso Books",
    "published_date": "2015-09-28",
    "stock": 10,
    "status": "Reserved",
    "description": "The political autobiography of the insurgent presidential candidate Bernie Sanders’s campaign for the presidency of the United States has galvanized people all over the country, putting economic, racial, and social justice into the spotlight, and raising hopes that Americans can take their country back from the billionaires and change the course of history. In this book, Sanders tells the story of a passionate and principled political life. He describes how, after cutting his teeth in the Civil Rights movement, he helped build a grassroots political movement in Vermont, making it possible for him to become the first independent elected to the US House of Representatives in forty years. The story continues into the US Senate and through the dramatic launch of his presidential campaign.",
    "image": "http://books.google.com/books/content?id=ZanaCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781784784188.png"
  },
  {
    "title": "Virtual Freedom",
    "authors": [
      "Chris C. Ducker"
    ],
    "isbn": "9781939529756",
    "edition": "4",
    "genre": "Business & Economics",
    "publisher": "BenBella Books, Inc.",
    "published_date": "2014-04-01",
    "stock": 23,
    "status": "Available",
    "description": "Entrepreneurs often suffer from \"superhero syndrome\"—the misconception that to be successful, they must do everything themselves. Not only are they the boss, but also the salesperson, HR manager, copywriter, operations manager, online marketing guru, and so much more. It's no wonder why so many people give up the dream of starting a business—it's just too much for one person to handle. But outsourcing expert and \"Virtual CEO,\" Chris Ducker knows how you can get the help you need with resources you can afford. Small business owners, consultants, and online entrepreneurs don't have to go it alone when they discover the power of building teams of virtual employees to help run, support, and grow their businesses. Virtual Freedom: How to Work with Virtual Staff to Buy More Time, Become More Productive, and Build Your Dream Business is the step-by-step guide every entrepreneur needs to build his or her business with the asset of working with virtual employees. Focusing on business growth, Ducker explains every detail you need to grasp, from figuring out which jobs you should outsource to finding, hiring, training, motivating, and managing virtual assistants. With additional tactics and online resources, Virtual Freedom is the ultimate resource of the knowledge and tools necessary for building your dream business with the help of virtual staff.",
    "image": "http://books.google.com/books/content?id=Q5vfAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781939529756.png"
  },
  {
    "title": "The Garden",
    "authors": [
      "Jon Gordon"
    ],
    "isbn": "9781119430667",
    "edition": "4",
    "genre": "Business & Economics",
    "publisher": "John Wiley & Sons",
    "published_date": "2020-05-21",
    "stock": 44,
    "status": "Checked Out",
    "description": "From bestselling author Jon Gordon comes a spiritual fable about the power of faith, hope, and love Meet Jay and Kay. They’re twins, and like many teenagers their age, they’re dealing with stress and anxiety. One day on their way to school, they have a nice conversation with their old family friend and youth soccer coach, Mr. Erwin, who shows them a special garden he created in his backyard. The garden serves as both a place and a metaphor for Mr. Erwin to share a powerful paradigm and practical strategies to help the twins overcome their fear, stress, and anxiety. The Garden is an enlightening and encouraging spiritual fable that reveals the 5 D’s that can sabotage us and a proven plan to help us overcome and win the battle in our mind. Rooted in Jon Gordon’s faith tradition, this fable is a different kind of book than his previous business fables. However, in his familiar trademark style, he takes a complex subject and simplifies it to help people take action and improve their lives. Everyone will struggle with fear, anxiety, or stress at some point in their lives, and everyone will have to overcome these challenges to create the life they were meant to live. Given that there are many contributing factors that influence how we think and feel, Jon wrote this book to share how the power of love, encouragement, truth, faith, and belief can be part of the solution. Having worked with countless leaders, companies, sports teams, professional athletes, and high school students, Jon Gordon infuses this life-changing story with thought-provoking ideas, practical strategies, and a framework to overcome fear with faith. Whether you are dealing with fear, stress, and anxiety yourself, have a family member that struggles, or are a mental health expert that works with clients, if any of the ideas in this book can be useful to you or the people you love and care about, then it’s worth a walk through The Garden with Jay, Kay, and Mr. Erwin to discover ways to persevere through life with the power of faith, hope, and love.",
    "image": "http://books.google.com/books/content?id=oDXnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781119430667.png"
  },
  {
    "title": "The Bestseller...",
    "authors": [
      "Ajitabha Bose"
    ],
    "isbn": "9789390760121",
    "edition": "1",
    "genre": "Fiction",
    "publisher": "Ajitabha Publishers",
    "published_date": "2021-04-02",
    "stock": 41,
    "status": "Reserved",
    "description": "Every author wants to become a bestseller one day. Over 1 Lac books are published in India every year! Only a few become a bestseller. Have you ever wondered how it is to live a life of a bestselling author? Come, read a heart warming tale of love, life and dreams. It’s Priyanshi’s story and her dream to become a bestseller.",
    "image": "http://books.google.com/books/content?id=AfsoEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9789390760121.png"
  },
  {
    "title": "Spring Recipes",
    "authors": [
      "Daniel Rubio",
      "Josh Long",
      "Gary Mak",
      "Marten Deinum"
    ],
    "isbn": "9781430259091",
    "edition": "2",
    "genre": "Computers",
    "publisher": "Apress",
    "published_date": "2014-11-14",
    "stock": 48,
    "status": "Reserved",
    "description": "Spring Recipes: A Problem-Solution Approach, Third Edition builds upon the best-selling success of the previous editions and focuses on the latest Spring Framework features for building enterprise Java applications. This book provides code recipes for the following, found in the latest Spring: Spring fundamentals: Spring IoC container, Spring AOP/ AspectJ, and more. Spring enterprise: Spring Java EE integration, Spring Integration, Spring Batch, Spring Remoting, messaging, transactions, and working with big data and the cloud using Hadoop and MongoDB. Spring web: Spring MVC, other dynamic scripting, integration with the popular Grails Framework (and Groovy), REST/web services, and more This book guides you step-by-step through topics using complete and real-world code examples. When you start a new project, you can consider copying the code and configuration files from this book, and then modifying them for your needs. This can save you a great deal of work over creating a project from scratch!",
    "image": "http://books.google.com/books/content?id=NL08BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781430259091.png"
  },
  {
    "title": "What Readers Do",
    "authors": [
      "Beth Driscoll"
    ],
    "isbn": "9781350375161",
    "edition": "5",
    "genre": "Literary Criticism",
    "publisher": "Bloomsbury Publishing",
    "published_date": "2024-02-21",
    "stock": 49,
    "status": "Checked Out",
    "description": "Shining a spotlight on everyday readers of the 21st century, Beth Driscoll explores how contemporary readers of Anglophone fiction interact with the book industry, digital environments, and each other. We live in an era when book clubs, bibliomemoirs, Bookstagram and BookTok are as valuable to some readers as solitary reading moments. The product of nearly two decades of qualitative research into readers and reading culture, What Readers Do examines reading through three dimensions - aesthetic conduct, moral conduct, and self-care \u0096 to show how readers intertwine private and social behaviors, and both reinforce and oppose the structures of capitalism. Analyzing reading as a post-digital practice that is a synthesis of both print and digital modes and on- and offline behaviors, Driscoll presents a methodology for studying readers that connects book history, literary studies, sociology, and actor-network theory. Arguing for the vitality, agency, and creativity of readers, this book sheds light on how we read now - and on how much more readers do than just read.",
    "image": "http://books.google.com/books/content?id=IqXuEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781350375161.png"
  },
  {
    "title": "Phantom Game",
    "authors": [
      "Christine Feehan"
    ],
    "isbn": "9780593439098",
    "edition": "2",
    "genre": "Fiction",
    "publisher": "Penguin",
    "published_date": "2022-03-01",
    "stock": 18,
    "status": "Available",
    "description": "Two predators collide with unbridled passion in this intoxicating GhostWalker novel from #1 New York Times bestselling author Christine Feehan. Jonas “Smoke” Harper has watched his brothers find their perfect mates, never imagining he’d actually meet someone who complements every part of him—even the monster that lurks within. But his instant connection with Camellia goes far beyond wanting the intelligent, beautiful, and lethal woman in his bed. They are two parts of a whole, linked to each other and to a larger network that exists everywhere around them. Camellia has lived on her own for a long time, relying on her unique psychic abilities to keep her safe. She knows that Jonas was literally made for her, and that makes their addictive connection more dangerous than a thousand enhanced super soldiers. Once the larger threat looming over them is dealt with she’s going to get far away as fast as she can. Life has taught her that the only one she can truly trust is herself. Jonas can sense Camellia is going to run—and the hunter inside doesn’t want to let go. Not when he knows how good they’ll be together. So he’ll just have to use all of his considerable skills to convince her to stay....",
    "image": "http://books.google.com/books/content?id=AxIxEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780593439098.png"
  },
  {
    "title": "Encyclopedia of Contemporary Chinese Culture",
    "authors": [
      "Edward L. Davis"
    ],
    "isbn": "9781134549535",
    "edition": "1",
    "genre": "History",
    "publisher": "Routledge",
    "published_date": "2004-08-02",
    "stock": 41,
    "status": "Reserved",
    "description": "This is the first reference book to digest this vast cultural output and make it accessible to the English-speaking world. It contains nearly 1,200 entries written by an international team of specialists, to enable readers to explore a range of diverse and fascinating cultural subjects from prisons to rock groups, underground Christian churches to TV talk shows and radio hotlines. Experimental artists with names such as 'Big-Tailed Elephants' and 'The North-Pole Group' nestle between the covers alongside entries on lotteries, gay cinema, political jokes, sex shops, theme parks, 'New Authoritarians' and 'Little Emperors'. While the focus of the Encyclopedia of Contemporary Chinese Culture is on mainland China since 1980, it also includes longer, specially commissioned entries on various aspects of contemporary culture in Hong Kong and Taiwan. Including full and up-to-date references for further reading, this is an indispensable reference tool for all teachers and students of contemporary Chinese culture. It will also be warmly embraced as an invaluable source of cultural context by tourists, journalists, business people and others who visit China.",
    "image": "http://books.google.com/books/content?id=YL4GS9zju10C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781134549535.png"
  },
  {
    "title": "What Would Jesus Read?",
    "authors": [
      "Erin A. Smith"
    ],
    "isbn": "9781469621333",
    "edition": "5",
    "genre": "Religion",
    "publisher": "UNC Press Books",
    "published_date": "2015-04-13",
    "stock": 5,
    "status": "Checked Out",
    "description": "Since the late nineteenth century, religiously themed books in America have been commercially popular yet scorned by critics. Working at the intersection of literary history, lived religion, and consumer culture, Erin A. Smith considers the largely unexplored world of popular religious books, examining the apparent tension between economic and religious imperatives for authors, publishers, and readers. Smith argues that this literature served as a form of extra-ecclesiastical ministry and credits the popularity and longevity of religious books to their day-to-day usefulness rather than their theological correctness or aesthetic quality. Drawing on publishers' records, letters by readers to authors, promotional materials, and interviews with contemporary religious-reading groups, Smith offers a comprehensive study that finds surprising overlap across the religious spectrum--Protestant, Catholic, and Jewish, liberal and conservative. Smith tells the story of how authors, publishers, and readers reconciled these books' dual function as best-selling consumer goods and spiritually edifying literature. What Would Jesus Read? will be of interest to literary and cultural historians, students in the field of print culture, and scholars of religious studies.",
    "image": "http://books.google.com/books/content?id=GEahBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781469621333.png"
  },
  {
    "title": "Starting a Business All-in-One For Dummies",
    "authors": [
      "Bob Nelson",
      "Eric Tyson"
    ],
    "isbn": "9781119565246",
    "edition": "5",
    "genre": "Business & Economics",
    "publisher": "John Wiley & Sons",
    "published_date": "2019-05-03",
    "stock": 33,
    "status": "Available",
    "description": "Starting a business? Don't sweat it! With all-new content and updates reflecting the latest laws, business climate, and startup considerations, Starting a Business All-In-One For Dummies, 2nd Edition, is the book you need if you’re starting a business today. Inside, you’ll find the most important practical advice you need to start any type of business from the ground up, distilled from 10 bestselling For Dummies business titles. Covering all startup business phases through the first year of operation, this guide will help you turn your winning idea into a winning business plan. You’ll get simple step-by-step instructions as you go, all the way to marketing, branding, taxes, and human resources. Start up a dream business from scratch Write a winning business plan Secure financing Manage your risks successfully Navigate your first year of operation If you’re a go-getter looking for a way to launch a great idea and be your own boss, Starting a Business All-In-One For Dummies prepares you to beat the odds and become successful in your sector.",
    "image": "http://books.google.com/books/content?id=vYSWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781119565246.png"
  },
  {
    "title": "Prizing Children's Literature",
    "authors": [
      "Kenneth B. Kidd",
      "Joseph T. Thomas Jr."
    ],
    "isbn": "9781317231424",
    "edition": "1",
    "genre": "Literary Criticism",
    "publisher": "Taylor & Francis",
    "published_date": "2016-11-10",
    "stock": 29,
    "status": "Reserved",
    "description": "Children's book awards have mushroomed since the early twentieth-century and especially since the 1960s, when literary prizing became a favored strategy for both commercial promotion and canon-making. There are over 300 awards for English-language titles alone, but despite the profound impact of children’s book awards, scholars have paid relatively little attention to them. This book is the first scholarly volume devoted to the analysis of Anglophone children's book awards in historical and cultural context. With attention to both political and aesthetic concerns, the book offers original and diverse scholarship on prizing practices and their consequences in Australia, Canada, and especially the United States. Contributors offer both case studies of particular awards and analysis of broader trends in literary evaluation and elevation, drawing on theoretical work on canonization and cultural capital. Sections interrogate the complex and often unconscious ideological work of prizing, the ongoing tension between formalist awards and so-called identity-based awards — all the more urgent in light of the \"We Need Diverse Books\" campaign — the ever-morphing forms and parameters of prizing, and scholarly practices of prizing. Among the many awards discussed are the Pura Belpré Medal, the Inky Awards, the Canada Governor General Literary Award, the Printz Award, the Best Animated Feature Oscar, the Phoenix Award, and the John Newbery Medal, giving due attention to prizes for fiction as well as for non-fiction, poetry, and film. This volume will interest scholars in literary and cultural studies, social history, book history, sociology, education, library and information science, and anyone concerned with children's literature.",
    "image": "http://books.google.com/books/content?id=PCMlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781317231424.png"
  },
  {
    "title": "Christmasly Obedient",
    "authors": [
      "Julia Kent"
    ],
    "isbn": "9781950173846",
    "edition": "3",
    "genre": "Fiction",
    "publisher": "Julia Kent",
    "published_date": "2020-11-24",
    "stock": 49,
    "status": "Available",
    "description": "Tree picking in glorious, downeast Maine. Snow. Santa. Roaring fires, people you love, and a good life. What more could a guy want? Or, rather, two guys? Mike and Jeremy have a quiet life with Lydia, on her parents' family campground in Verily, Maine. It's a little boring, sure, but after the craziness of their old lives, what's wrong with boring? Besides, Jeremy and Mike find Lydia anything but. As Christmas looms, and an unexpected oops leaves them all in a state of uncertainty, they have to ask themselves: is it time to let life be a little less boring? And what's inside that slim box Lydia's giving them both on Christmas morning? Christmasly Obedient is a new holiday book in Julia Kent's USA Today bestselling Obedient series.",
    "image": "http://books.google.com/books/content?id=3xUFEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781950173846.png"
  },
  {
    "title": "Asterix Omnibus Vol. 8",
    "authors": [
      "Albert Uderzo",
      "René Goscinny"
    ],
    "isbn": "9781545811566",
    "edition": "2",
    "genre": "Juvenile Fiction",
    "publisher": "Simon and Schuster",
    "published_date": "2024-06-11",
    "stock": 45,
    "status": "Checked Out",
    "description": "Contains 3 newly-translated classic Asterix tales. Asterix is a fearless Gaul with a magic potion that grants him incredible strength to protect his village and ward off Roman Empire from invading. With his pal, Obelix, the defend their village from not only the blundering Roman legionairies, but also lend their services to the rest of the world. First, Asterix and Obelix’s fishing trip goes wrong when they make “The Great Crossing” and wind up on the shores of North America. Neither America, nor Asterix, will ever be the same after this comical invasion. Second, Obelix gets the spotlight as his delivery service for stone menhir slabs gets a Roman update, becoming “Obelix and Co.” Will Obelix be too greedy? Probably! Then, third, watch your waffles, it’s “Asterix in Belgium,” writer and Asterix co-creator René Goscinny’s final story before his untimely death. It’s a tale of two tribes as the Gauls and the Belgians unite, and then unravel, all to keep out Caesar’s forces. Plus: a new Afterword by Alexander Simmons providing historical and cultural context for Asterix, both in 50 B.C. and in the time the classic comics were made.",
    "image": "http://books.google.com/books/content?id=9QAIEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781545811566.png"
  },
  {
    "title": "The White Queen",
    "authors": [
      "Philippa Gregory"
    ],
    "isbn": "9781416563914",
    "edition": "1",
    "genre": "Fiction",
    "publisher": "Simon and Schuster",
    "published_date": "2009-08-18",
    "stock": 22,
    "status": "Reserved",
    "description": "The inspiration for the critically acclaimed Starz miniseries The White Queen, #1 New York Times bestselling author Philippa Gregory brings to life the extraordinary story of Elizabeth Woodville, a woman who rises from obscurity to become Queen of England, and changes the course of history forever. Elizabeth Woodville is a woman of extraordinary beauty and ambition. Her mother is Jacquetta, also known as the mystical lady of the rivers, and she is even more determined to bring power and wealth to the family line. While riding in the woods one day, Elizabeth captures the attentions of the newly crowned King Edward IV and, despite her common upbringing, marries him in secret. When she is raised up to be his queen, the English court is outraged, but Elizabeth rises to the demands of her exalted position and fights for her family’s dominance. Yet despite her best efforts, and even with the help of her mother’s powers, her two sons become pawns in a famous unsolved mystery that has confounded historians for centuries: the lost princes in the Tower of London. In this dazzling account of the deadly Wars of the Roses, brother turns on brother to win the ultimate prize: the throne of England.",
    "image": "http://books.google.com/books/content?id=H6u8zvGL2vgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781416563914.png"
  },
  {
    "title": "The Girl who Played with Fire",
    "authors": [
      "Stieg Larsson"
    ],
    "isbn": "9780307476159",
    "edition": "4",
    "genre": "Blomkvist, Mikael (Fictitious character)",
    "publisher": "Vintage",
    "published_date": "2010",
    "stock": 49,
    "status": "Reserved",
    "description": "When the reporters to a sex-trafficking exposé are murdered and computer hacker Lisbeth Salander is targeted as the killer, Mikael Blomkvist, the publisher of the exposé, investigates to clear Lisbeth's name.",
    "image": "http://books.google.com/books/content?id=_1cjSaWKU8UC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9780307476159.png"
  },
  {
    "title": "The Oxford History of the Novel in English",
    "authors": [
      "Priscilla Wald",
      "Michael A. Elliott"
    ],
    "isbn": "9780199909032",
    "edition": "3",
    "genre": "Literary Criticism",
    "publisher": "Oxford University Press",
    "published_date": "2014-01-21",
    "stock": 14,
    "status": "Checked Out",
    "description": "Witnessing the end of a war that nearly terminated the nation, the abolition of racial slavery and rise of legal segregation, the rise of Modernism and Hollywood, the closing of the frontier and two World Wars, the literary historical period represented in this volume constitutes the crucible of American literary history. Here, 35 essays by top researchers in the field detail how considerations of race and citizenship; immigration and assimilation; gender and sexuality; nationalism and empire; all reverberate throughout novels written in the United States between 1870 and 1940. Contributors discuss the professionalization of literary production after the Civil War alongside legal and political debates over segregation and citizenship; while chapters on journalism, geography, religion, and immigration offer discussions on everything from the lasting role of literary realism in American fiction to the Spanish-American War's effect on developing theories of aesthetics and popular culture. The volume offers thorough coverage of the emergence of serial fiction, children's fiction, crime and detective fiction, science fiction, and even cinema and comics, as new media and artistic revolutions like the Harlem Renaissance helped usher in the new international aesthetic movement of Modernism. The final chapters in the volume explore the relationship of the novel to the emergence of \"American literature\" as a category in the academy, in public criticism and journalism, and in mass culture.",
    "image": "http://books.google.com/books/content?id=vmPwAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780199909032.png"
  },
  {
    "title": "Marketing For Dummies",
    "authors": [
      "Jeanette Maw McMurtry"
    ],
    "isbn": "9781119365556",
    "edition": "3",
    "genre": "Business & Economics",
    "publisher": "John Wiley & Sons",
    "published_date": "2017-05-18",
    "stock": 48,
    "status": "Available",
    "description": "The classic, bestselling marketing guide, updated for the digital era Marketing For Dummies, 5th Edition is the ultimate handbook for boosting your business. Whether you're a small mom-and-pop shop, a local nonprofit, or a mid-size business looking to grow, the right marketing approach can make your company or organization stand out from the crowd. This book shows you how to find, reach, and engage with your customers in a way that brings in business. This new edition, updated to align with the latest marketing revolution, introduces you to essential techniques including search engine, guerilla, global, and behavior marketing. You'll learn where to find your people, and how to give them what they want—how they want it—using behavioral techniques. You'll discover inexpensive online marketing and promotion tools, proving that budget doesn't have to be an insurmountable obstacle. You'll find up-to-date marketing plans, resources, and examples throughout to help you get out there and get your business noticed today! Today's marketing treats every aspect of customer interaction—including customer service and the product itself—as an opportunity to grow. This book shows you how to harness the power of these techniques to drive traffic, boost sales, and move your business forward. Turn web visibility into real-world traffic and sales Reach the right people at the right time Develop a cohesive marketing plan for any budget Source locally, market dynamically, and connect with your community Whether you're looking for fundamental marketing skills, seeking guidance on social media and analytics, or need a full-blown comprehensive web marketing strategy, this book has you covered. Marketing For Dummies, 5th Edition helps you open the door to a new, more successful phase of business.",
    "image": "http://books.google.com/books/content?id=6EwnDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781119365556.png"
  },
  {
    "title": "Reactive Programming with RxJava",
    "authors": [
      "Tomasz Nurkiewicz",
      "Ben Christensen"
    ],
    "isbn": "9781491931608",
    "edition": "3",
    "genre": "Computers",
    "publisher": "\"O'Reilly Media, Inc.\"",
    "published_date": "2016-10-06",
    "stock": 24,
    "status": "Available",
    "description": "In today’s app-driven era, when programs are asynchronous and responsiveness is so vital, reactive programming can help you write code that’s more reliable, easier to scale, and better-performing. With this practical book, Java developers will first learn how to view problems in the reactive way, and then build programs that leverage the best features of this exciting new programming paradigm. Authors Tomasz Nurkiewicz and Ben Christensen include concrete examples that use the RxJava library to solve real-world performance issues on Android devices as well as the server. You’ll learn how RxJava leverages parallelism and concurrency to help you solve today’s problems. This book also provides a preview of the upcoming 2.0 release. Write programs that react to multiple asynchronous sources of input without descending into \"callback hell\" Get to that aha! moment when you understand how to solve problems in the reactive way Cope with Observables that produce data too quickly to be consumed Explore strategies to debug and to test programs written in the reactive style Efficiently exploit parallelism and concurrency in your programs Learn about the transition to RxJava version 2",
    "image": "http://books.google.com/books/content?id=gYY1DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781491931608.png"
  },
  {
    "title": "The Publishing Business",
    "authors": [
      "Kelvin Smith",
      "Melanie Ramdarshan Bold"
    ],
    "isbn": "9781474249539",
    "edition": "1",
    "genre": "Business & Economics",
    "publisher": "Bloomsbury Publishing",
    "published_date": "2018-02-22",
    "stock": 10,
    "status": "Checked Out",
    "description": "The Publishing Business, is an invaluable guide to understanding what book publishing is and what it might become. Using popular and current examples, this second edition demonstrates that, to succeed, publishers must prove their commitment to producing accurate, attractive and well edited content, their ability to innovate pioneering digital technologies and their dedication to promoting their titles to new audiences. This book explains the responsibilities at each stage of the publishing process, describes current roles and practices, and provides much food for thought on how publishers can ensure their skills remain relevant in the digital age. Fully updated to take into account recent developments in the publishing world, this new edition also includes additional real-world examples from a variety of publishing sectors, insightful interviews with industry experts and new and updated activities throughout. Beautifully designed, thoroughly illustrated and packed with examples of publishing practice, The Publishing Business is an essential introduction to a dynamic industry.",
    "image": "http://books.google.com/books/content?id=psdIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781474249539.png"
  },
  {
    "title": "The Age of Melodramatic Miniseries",
    "authors": [
      "Scott Humphries"
    ],
    "isbn": "9781476649825",
    "edition": "4",
    "genre": "Performing Arts",
    "publisher": "McFarland",
    "published_date": "2023-03-24",
    "stock": 40,
    "status": "Checked Out",
    "description": "Glamour, power, champagne breakfasts in satin sheets--welcome to television's most dazzling and overlooked genre: women-centric melodrama miniseries of the 1980s and 1990s. Decades before Real Housewives, rags-to-riches fantasies depicting strong women overcoming tragedy to take charge of their destinies were a big hit with TV audiences. Reflecting the \"greed is good\" ethos of the day and encoded with feminist messaging, these glitzy, often camp stories depicted statuesque superwomen facing off with square-jawed men in boardrooms and bedrooms. This book explores the shows that epitomized the prime-time soap era and gave us such memorable scenes as Stefanie Powers trading lovers with her twin sister, Joan Collins fighting Nazis in haute couture and Phoebe Cates demanding, \"Which one of you bitches is my mother?\"",
    "image": "http://books.google.com/books/content?id=fZS1EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781476649825.png"
  },
  {
    "title": "Exploring Corporate Human Rights Responsibilities in OECD Case Law",
    "authors": [
      "Otgontuya Davaanyam",
      "Markus Krajewski"
    ],
    "isbn": "9783031757174",
    "edition": "3",
    "genre": "Law",
    "publisher": "Springer Nature",
    "published_date": "2025-01-03",
    "stock": 18,
    "status": "Reserved",
    "description": "This open access book consolidates a collection of scholarly papers presented at the academic conference titled \"Corporate Human Rights Responsibility in OECD Case Law: Actors, Issues, Responsibilities, and Remedies\", held on 4 and 5 May 2023. The conference was organized by the OECD Case Law Project at Friedrich-Alexander-Universität Erlangen-Nürnberg. The book is divided into three sections. The first examines how NCP cases interpret corporate responsibilities, including financial institutions, on human rights and environmental issues, focusing on climate change and conflict-affected zones. It also highlights how OECD cases address corporate accountability and its impact on the revised OECD Guidelines and the EU Corporate Sustainability Due Diligence Directive (CSDDD). The second section critically evaluates the NCP mechanism's effectiveness, assessing whether it provides substantive remedies and how well NCP mediation resolves disputes. It offers both quantitative and qualitative analysis of the grievance processes in line with UNGP effectiveness criteria. The third section explores the NCP’s role in global corporate responsibility frameworks, particularly its potential influence on shaping mandatory due diligence obligations through frameworks like the CSDDD, reinforcing corporate accountability in international business practices. Additionally, the book offers key recommendations for policymakers, NCP experts, and practitioners on improving the NCP system to ensure more meaningful outcomes for human rights violations.",
    "image": "http://books.google.com/books/content?id=JCA8EQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9783031757174.png"
  },
  {
    "title": "City of Glass",
    "authors": [
      "Cassandra Clare"
    ],
    "isbn": "9781439158425",
    "edition": "1",
    "genre": "Young Adult Fiction",
    "publisher": "Simon and Schuster",
    "published_date": "2009-03-24",
    "stock": 18,
    "status": "Available",
    "description": "Love is a mortal sin, and the secrets of the past are deadly. Plunge into the third installment in the internationally bestselling Mortal Instruments series and “prepare to be hooked” (Entertainment Weekly). To save her mother’s life, Clary must travel to the City of Glass, the ancestral home of the Shadowhunters—never mind that entering the city without permission is against the Law, and breaking the Law could mean death. To make things worse, she learns that Jace does not want her there, and Simon has been thrown in prison by the Shadowhunters, who are deeply suspicious of a vampire who can withstand sunlight. As Clary uncovers more about her family’s past, she finds an ally in mysterious Shadowhunter Sebastian. With Valentine mustering the full force of his power to destroy all Shadowhunters forever, their only chance to defeat him is to fight alongside their eternal enemies. But can Downworlders and Shadowhunters put aside their hatred to work together? While Jace realizes exactly how much he’s willing to risk for Clary, can she harness her newfound powers to help save the Glass City—whatever the cost? Love is a mortal sin and the secrets of the past prove deadly as Clary and Jace face down Valentine in the third installment of bestselling series the Mortal Instruments. Includes an exclusive sneak peek of the fourth book in the Mortal Instruments series: City of Fallen Angels! And don't miss the teaser from Clockwork Angel, the first book in the Infernal Devices trilogy, the prequel to the Mortal Instruments series.",
    "image": "http://books.google.com/books/content?id=r63oLL3zwpsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781439158425.png"
  },
  {
    "title": "Mount!",
    "authors": [
      "Jilly Cooper"
    ],
    "isbn": "9781448170876",
    "edition": "3",
    "genre": "Fiction",
    "publisher": "Random House",
    "published_date": "2016-09-08",
    "stock": 6,
    "status": "Reserved",
    "description": "Rupert Campbell-Black takes centre stage once more, this time in the cut-throat world of flat racing. Rupert is consumed by one obsession: that Love Rat, his adored grey horse, be proclaimed champion stallion. He longs to trounce Roberto's Revenge, the stallion owned by his detested rival Cosmo Rannaldini, which means abandoning his racing empire at Penscombe and his darling wife Taggie, and chasing winners in the richest races worldwide, from Dubai to Los Angeles to Melbourne. Luckily, the fort at home is held by Rupert's assistant Gav, a genius with horses, fancied by every stable lass, but damaged by alcoholism and a vile wife. When Gala, a grieving but ravishing Zimbabwean widow moves to Penscombe as carer for Rupert's wayward father, it is not just Gav who is attracted to her: a returning Rupert finds himself dangerously tempted. Gala adores horses, and when she switches to working in the yard, her carer's job is taken by a devastatingly handsome South African man who claims to be gay but seems far keener on caring for the angelic Taggie. And as increasingly sinister acts of sabotage strike at Penscombe, the game of musical loose boxes gathers apace . . . ----------------------------------- 'Packed with warmth, wit, and unforgettable characters, this is an utterly joyous read' Daily Express 'Pure, unadulterated joy' Sophie Kinsella 'It's Cooper doing what she does best ... it's a thoroughly enjoyable roll in the hay' The Times 'Witty and wonderful, as always' Trisha Ashley 'This endlessly fun humdinger of a novel is an absolute riot' Heat",
    "image": "http://books.google.com/books/content?id=7rCkCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781448170876.png"
  },
  {
    "title": "The Automatic Millionaire Workbook",
    "authors": [
      "David Bach"
    ],
    "isbn": "9780767920247",
    "edition": "2",
    "genre": "Business & Economics",
    "publisher": "Crown Currency",
    "published_date": "2005-02-22",
    "stock": 34,
    "status": "Available",
    "description": "With this essential companion to the automatic #1 national bestseller, you can put pencil to paper and make your seven-figure dreams come true! The Automatic Millionaire rocketed to instant bestseller status because in its pages America’s best-loved money coach, David Bach, delivered a uniquely foolproof, hassle-free plan for achieving financial security even if you have zero willpower. Now The Automatic Millionaire Workbook lets you tailor that strategy to your own financial life in a line-by-line personal plan. The workbook features: The five questions that determine with 90 percent certainty if you will be an Automatic Millionaire Charts and checklists for paying down debt while you save A clear path for any renter to become a home owner Worksheets to set savings goals and meet them, no matter how much you make A game plan for paying off mortgages early The one crucial step that guarantees your financial plan will succeed Details on where to invest, what phone calls to make, and exactly what to say when automating your financial future Along the way, you will be inspired by stories of ordinary Americans from all walks of life who are becaming Automatic Millionaires. The Automatic Millionaire Workbook makes it easier than ever for you to put your financial life on autopilot and finish rich –-without a budget. You’ve dreamed it, now write it and do it. The rest is automatic!",
    "image": "http://books.google.com/books/content?id=s3zK0AUz_-AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780767920247.png"
  },
  {
    "title": "Three Sisters, Three Queens",
    "authors": [
      "Philippa Gregory"
    ],
    "isbn": "9781476758749",
    "edition": "3",
    "genre": "Fiction",
    "publisher": "Simon and Schuster",
    "published_date": "2016",
    "stock": 31,
    "status": "Reserved",
    "description": "Includes a reading group guide with discussion questions, an interview with the author, and book club enhancement suggestions.",
    "image": "http://books.google.com/books/content?id=_B0gDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781476758749.png"
  },
  {
    "title": "Handbook of Social Media Management",
    "authors": [
      "Mike Friedrichsen",
      "Wolfgang Mühl-Benninghaus"
    ],
    "isbn": "9783642288975",
    "edition": "5",
    "genre": "Business & Economics",
    "publisher": "Springer Science & Business Media",
    "published_date": "2013-05-28",
    "stock": 40,
    "status": "Checked Out",
    "description": "Digitization and Web 2.0 have brought about continuous change from traditional media management to new strategic, operative and normative management options. Social media management is on the agenda of every media company, and requires a new set of specialized expertise on digital products and communication. At the same time, social media has become a vibrant field of research for media economists and media management researchers. In this handbook, international experts present a comprehensive account of the latest developments in social media research and management, consistently linking classical media management with social media. The articles discuss new theoretical approaches as well as empirical findings and applications, yielding an interesting overview of interdisciplinary and international approaches. The book’s main sections address forms and content of social media; impact and users; management with social media; and a new value chain with social media. The book will serve as a valuable reference work for researchers, students and professionals working in media and public relations.",
    "image": "http://books.google.com/books/content?id=ETHak9WHJGAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9783642288975.png"
  },
  {
    "title": "The Latte Factor",
    "authors": [
      "David Bach",
      "John David Mann"
    ],
    "isbn": "9781982120245",
    "edition": "3",
    "genre": "Business & Economics",
    "publisher": "Simon and Schuster",
    "published_date": "2019-05-07",
    "stock": 0,
    "status": "Reserved",
    "description": "INSTANT NEW YORK TIMES, USA TODAY, WALL STREET JOURNAL, AND INTERNATIONAL BESTSELLER Discover #1 New York Times bestselling author David Bach’s three secrets to financial freedom in an engaging story that will show you that you are richer than you think. Drawing on the author’s experiences teaching millions of people around the world to live a rich life, this fast, easy listen reveals how anyone—from millennials to baby boomers—can still make his or her dreams come true. In this compelling, heartwarming parable, Bach and his bestselling coauthor John David Mann (The Go-Giver) tell the story of Zoey, a twenty-something woman living and working in New York City. Like many young professionals, Zoey is struggling to make ends meet under a growing burden of credit card and student loan debt, working crazy hours at her dream job but still not earning enough to provide a comfortable financial cushion. At her boss’s suggestion, she makes friends with Henry, the elderly barista at her favorite Brooklyn coffee shop. Henry soon reveals his “Three Secrets to Financial Freedom,” ideas Zoey dismisses at first but whose true power she ultimately comes to appreciate. Over the course of a single week, Zoey discovers that she already earns enough to secure her financial future and realize her truest dreams—all she has to do is make a few easy shifts in her everyday routine. The Latte Factor demystifies the secrets to achieving financial freedom, inspiring you to realize that it’s never too late to reach for your dreams. By following the simple, proven path that Henry shows Zoey, anyone can make small changes today that will have big impact for a lifetime, proving once again that “David Bach is the financial expert to listen to when you’re intimidated by your finances” (Tony Robbins, #1 New York Times bestselling author of Money: Master the Game).",
    "image": "http://books.google.com/books/content?id=_Ep9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781982120245.png"
  },
  {
    "title": "From a Far and Lovely Country",
    "authors": [
      "Alexander McCall Smith"
    ],
    "isbn": "9781039004436",
    "edition": "3",
    "genre": "Fiction",
    "publisher": "Random House",
    "published_date": "2024-09-03",
    "stock": 35,
    "status": "Reserved",
    "description": "In this latest installment in Alexander McCall Smith's cherished No. 1 Ladies' Detective Agency series, two confounding cases compete for Mma Ramotswe's attention—and she may need to call in back up. Mma Ramotswe and Mr. J.L.B Matekoni are enjoying a nice meal out at a peri-peri restaurant when an American woman named Julia approaches seeking Mma Ramotswe's help. Julia's beloved late grandfather was Botswanan, and he instilled in her an abiding love of his homeland. Now, years after his passing and during a rough patch in her own life, Julia has come to visit the land he had spoken of so often and to find her relatives. Unfortunately, her grandfather's stories, while remarkably charming and entertaining, were somewhat light on detail; all Julia can remember are a few first names and some descriptions of his village. It's not a lot to go on, but if anyone is well poised to help, it's Mma Ramotswe, Botswana's premier detective. Meanwhile, a second case leads Mma Ramotswe to look for support from an unexpected quarter. For the first time ever, assistant detective Charlie leads his own investigation at the agency, going undercover into a dubious, word-of-mouth get-together known as the Cool Singles Evening Club, where married men are encouraged to pretend to be single and meet women under false pretenses. Who could be behind such a distasteful venture? Getting to the bottom of this will be a tall order, to be sure, but Charlie is eager for the opportunity. As Mma Ramotswe learns more about Julia, she begins to understand that Julia's heartbreak runs deeper than she had initially realized. Together, Mma Ramotswe and Mma Potokwane must find a way to help their client heal and move forward—from both her past and her present. Julia had originally come to Botswana seeking family and connection, but in the warm embrace of Mma Ramotswe and Mma Potokwane, what she ends up finding is a home.",
    "image": "http://books.google.com/books/content?id=bsEIEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781039004436.png"
  },
  {
    "title": "International Business Strategy and Cross-Cultural Management",
    "authors": [
      "Richter, Nicole F.",
      "Strandskov, Jesper",
      "Hauff, Sven",
      "Taras, Vasyl"
    ],
    "isbn": "9781839108631",
    "edition": "2",
    "genre": "Business & Economics",
    "publisher": "Edward Elgar Publishing",
    "published_date": "2022-03-15",
    "stock": 25,
    "status": "Checked Out",
    "description": "This comprehensive yet accessible textbook provides readers with an advanced and applied approach to traditional international business that integrates key cross-cultural management topics. Its ten chapters give profound insights into analysing, selecting and entering international markets, strategic partnerships, strategic positioning, global value chains, organizational designs, intercultural interaction, leadership and motivation and international human resources management. For each of these topics, advanced and contemporary theoretical and analytical frameworks are discussed and translated into toolsets that will assist readers in solving practical challenges.",
    "image": "http://books.google.com/books/content?id=b61jEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781839108631.png"
  },
  {
    "title": "Write A Blockbuster - And Get It Published: Teach Yourself",
    "authors": [
      "Helen Corner"
    ],
    "isbn": "9781444129847",
    "edition": "1",
    "genre": "Reference",
    "publisher": "Hachette UK",
    "published_date": "2010-04-30",
    "stock": 41,
    "status": "Available",
    "description": "Designed for all those wanting to be the next Dan Brown, this introduction to writing popular fiction will be a key addition to the writer's bookshelf. Authored jointly by a literary consultant/agent and a highly successful author, it offers not simply a guide to writing a novel but an introduction to writing a plot-based, action-focused blockbuster. It covers such key practicalities as the importance of plot, pace, action, character and the different demands of such popular commercial genres as romantic fiction, thrillers and so on. For those looking to write for a living, this book provides vital information on the process, including finding an agent and making a living as a writer. NOT GOT MUCH TIME? One, five and ten-minute introductions to key principles to get you started. AUTHOR INSIGHTS Lots of instant help with common problems and quick tips for success, based on the authors' many years of experience. TEST YOURSELF Tests in the book and online to keep track of your progress. EXTEND YOUR KNOWLEDGE Extra online articles at www.teachyourself.com to give you a richer understanding of how to write a blockbuster. FIVE THINGS TO REMEMBER Quick refreshers to help you remember the key facts. TRY THIS Innovative exercises illustrate what you've learnt and how to use it.",
    "image": "http://books.google.com/books/content?id=SHgiVpnIU1QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781444129847.png"
  },
  {
    "title": "Dog Man: Fetch-22: A Graphic Novel (Dog Man #8): From the Creator of Captain Underpants",
    "authors": [
      "Dav Pilkey"
    ],
    "isbn": "9781338323238",
    "edition": "4",
    "genre": "Juvenile Fiction",
    "publisher": "Scholastic Inc.",
    "published_date": "2019-12-10",
    "stock": 9,
    "status": "Available",
    "description": "Li'l Petey gets caught in some family drama in the eighth Dog Man book from worldwide bestselling author and artist Dav Pilkey. Petey the Cat is out of jail, and he has a brand-new lease on life. While Petey's reevaluated what matters most, Li'l Petey is struggling to find the good in the world. Can Petey and Dog Man stop fighting like cats and dogs long enough to put their paws together and work as a team? They need each other now more than ever -- Li'l Petey (and the world) is counting on them! Dav Pilkey's wildly popular Dog Man series appeals to readers of all ages and explores universally positive themes, including empathy, kindness, persistence, and the importance of doing good.",
    "image": "http://books.google.com/books/content?id=QruMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781338323238.png"
  },
  {
    "title": "Bared to You - Behind the Story (A Book Companion)",
    "authors": [
      "Behind the StoryTM Books"
    ],
    "isbn": "9781301144440",
    "edition": "2",
    "genre": "Study Aids",
    "publisher": "XinXii",
    "published_date": "2017-01-20",
    "stock": 50,
    "status": "Available",
    "description": "Loved the novel, but still hungry for more? If you've devoured the last morsel of your savory book, but have a stomach that yearns for more, \"Behind the Story\" will be a most delightful surprise. Enjoy this basket full of hand-picked treats, compiled as an easy, concise, info-rich serving just for you! You'll be on a VIP tour where we will take you by the hand to show you what is behind the curtains, what is \"Behind the Story\". Introducing: Behind the Story Series - Over 100 published titles and sold all over the world... and counting! - Over 17 5-star reviews alone! - Refined for quality by a team of Researchers, Authors, and Editors - Ranked page #1 in 96% of searches, ranked search result #2 in 9 titles! Experience why others are coming back for more. This is the second such companion book I've read in this series, and I'm anxiously awaiting more. By Ms. Eden (US/UK) for Major Pettigrew's Last Stand – March 22, 2012 My brother has almost all the Behind the Story books because he and his wife are avid readers and he lent me this one since I am such a Clancy fan... By Pauly Ortega for Against All Enemies August 21, 2011 Re-read the original book RIGHT AFTER reading this book! The original book suddenly became much richer and more enticing after I finished this Behind the Story, I HAD to open up the original book once more! Highly recommended! From Sherry Lawson for Hotel on the Corner of Bitter and Sweet, February 22, 2012 A sneak peek of what's inside: - Special invitation to become a Beta-Reader for Behind the Story. - Chance for you to win lifetime updates! - Bibliography and resources, great as study guides or research resource. - Trivia Questions and Discussion Starters, great for your book clubs! SAMPLE EXCERPT: “What was the inspiration behind the creation of this book?” Although many people have expressed how much Bared to You resembles Fifty Shades of Grey, Day said in interviews that her real inspiration for writing this book is her own novel, Seven Years to Sin. It is a historical novel also dealing with a couple recovering from difficult, abusive pasts. In Seven Years to Sin, the main characters were brought together by their histories. But Day wondered how it would be like if the past of two people very attracted to each other push them apart. What if their trauma inhibits them from connecting with the person they are in love with? Can an abuse survivor be able to have a functional and healthy romantic relationship with another abuse survivor? Day wanted to explore that. This premise, the desire to answer these questions at least in the context of a story, resulted in the plotline that will encompass the three books in the Crossfire series. - - - - - Don't miss out! It's highly recommended. if you're a real literature junkie or a diehard fan of the novel (I am both) it's really a must read. Highly recommended. - ForTheQuinn (Austin, TX, US) Disclaimer: This work is not meant to replace, but to complement the original work. If you've loved the novel, then this is the book for you. It is educational in purpose, entertaining in nature, unauthorized and unofficial. It is a digestive work produced to stimulate the appetite and to encourage readers to appreciate the original work even more.",
    "image": "http://books.google.com/books/content?id=yrrvDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781301144440.png"
  },
  {
    "title": "Handbook of Social Media Management",
    "authors": [
      "Mike Friedrichsen",
      "Wolfgang Mühl-Benninghaus"
    ],
    "isbn": "9783642288975",
    "edition": "2",
    "genre": "Business & Economics",
    "publisher": "Springer Science & Business Media",
    "published_date": "2013-05-28",
    "stock": 27,
    "status": "Available",
    "description": "Digitization and Web 2.0 have brought about continuous change from traditional media management to new strategic, operative and normative management options. Social media management is on the agenda of every media company, and requires a new set of specialized expertise on digital products and communication. At the same time, social media has become a vibrant field of research for media economists and media management researchers. In this handbook, international experts present a comprehensive account of the latest developments in social media research and management, consistently linking classical media management with social media. The articles discuss new theoretical approaches as well as empirical findings and applications, yielding an interesting overview of interdisciplinary and international approaches. The book’s main sections address forms and content of social media; impact and users; management with social media; and a new value chain with social media. The book will serve as a valuable reference work for researchers, students and professionals working in media and public relations.",
    "image": "http://books.google.com/books/content?id=ETHak9WHJGAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9783642288975.png"
  },
  {
    "title": "One Italian Summer",
    "authors": [
      "Rebecca Serle"
    ],
    "isbn": "9781982166793",
    "edition": "5",
    "genre": "Fiction",
    "publisher": "Simon and Schuster",
    "published_date": "2022-03",
    "stock": 40,
    "status": "Reserved",
    "description": "\"A moving and unforgettable exploration of the powerful bond between mother and daughter set on the breathtaking Amalfi Coast ... When Katy's mother dies, she is left reeling. Carol wasn't just Katy's mom, but her best friend and first phone call. To make matters worse, the mother-daughter trip of a lifetime looms: two weeks in Positano. Katy has been waiting years for Carol to take her, and now she is faced with embarking on the adventure alone. But as soon as she steps foot on the beautiful Amalfi Coast, Katy begins to feel her mother's spirit. And then Carol appears for real--in the flesh, healthy and sun-tanned ... and thirty years old. Katy doesn't understand what is happening, or how. But over the course of her time in Italy, Katy gets to know Carol in this new form, and soon she must reconcile the mother who knew everything with the young woman who does not yet have a clue. One Italian Summer is Rebecca Serle's next great love story, a transcendent novel about how we move on after loss, and how the people we love never truly leave us\"--",
    "image": "http://books.google.com/books/content?id=MTNcEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781982166793.png"
  },
  {
    "title": "The Paris Apartment",
    "authors": [
      "Lucy Foley"
    ],
    "isbn": "9780063003071",
    "edition": "2",
    "genre": "Fiction",
    "publisher": "HarperCollins",
    "published_date": "2022-02-22",
    "stock": 45,
    "status": "Checked Out",
    "description": "THE #1 NEW YORK TIMES BESTSELLER “Told in rotating points of view, this Tilt-A-Whirl of a novel brims with jangly tension – an undeniably engrossing guessing game.” — Vogue \"[A] clever, cliff-hanger-filled thriller.\" — People From the New York Times bestselling author of The Guest List comes a new locked room mystery, set in a Paris apartment building in which every resident has something to hide… Jess needs a fresh start. She’s broke and alone, and she’s just left her job under less than ideal circumstances. Her half-brother Ben didn’t sound thrilled when she asked if she could crash with him for a bit, but he didn’t say no, and surely everything will look better from Paris. Only when she shows up – to find a very nice apartment, could Ben really have afforded this? – he’s not there. The longer Ben stays missing, the more Jess starts to dig into her brother’s situation, and the more questions she has. Ben’s neighbors are an eclectic bunch, and not particularly friendly. Jess may have come to Paris to escape her past, but it’s starting to look like it’s Ben’s future that’s in question. The socialite – The nice guy – The alcoholic – The girl on the verge – The concierge Everyone's a neighbor. Everyone's a suspect. And everyone knows something they’re not telling.",
    "image": "http://books.google.com/books/content?id=rCU3EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780063003071.png"
  },
  {
    "title": "Charlotte Perriand",
    "authors": [
      "Justin McGuirk"
    ],
    "isbn": "9781872005522",
    "edition": "5",
    "genre": "Architecture",
    "publisher": null,
    "published_date": "2021",
    "stock": 31,
    "status": "Checked Out",
    "description": "An affordable, concise survey on the influential modernist designer's interiors, buildings, furniture and more, from a sawtooth ski resort to sculptural chaises longues From the onset of her career, Charlotte Perriand was a maverick who believed in good design as a force for the betterment of society. Many young designers would be devastated by a rejection from Le Corbusier's studio, but when the great architect told her they had no use for a female furniture designer, Perriand only became more determined to prove her mettle as an artist. Under Le Corbusier, and long after she left his studio, Perriand's contributions to both furniture design and architecture demonstrated a unique attention to the organic artistry of nature as well as the egalitarian possibilities of the machine age. Her leftwing populist politics motivated much of her work, from modular furniture systems to major architectural projects. This monograph explores Perriand's most famous interiors, original furniture and architectural projects, as well as her never-before-seen sketchbooks, shedding new light on her creative process and place in design history. Charlotte Perriand (1903-99) experienced the first breakthrough in her career with Le Bar sous le toit, a 1927 interior design piece that predicted the elegant minimalism and utilitarian nature of her future work. Although today she is perhaps best known for her early chaise longue designs, Perriand also created the plans for a number of major buildings across Europe and contributed interior designs to Le Corbusier's Unit d'habitation. She worked in places as diverse as Tokyo, Rio de Janeiro and London in her pursuit of accessible design.",
    "image": "http://books.google.com/books/content?id=Snf9zQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9781872005522.png"
  },
  {
    "title": "In My Heart",
    "authors": [
      "Jo Witek"
    ],
    "isbn": "9781647008284",
    "edition": "4",
    "genre": "Juvenile Fiction",
    "publisher": "Abrams",
    "published_date": "2014-10-14",
    "stock": 47,
    "status": "Checked Out",
    "description": "New York Times Bestseller! “A must-have for any storytime.” ―Kirkus Reviews “Childlike drawings evoke each feeling with a playful style.” ―Publishers Weekly “Evocative imagery, popping with bright colors.” —School Library Journal Happiness, sadness, bravery, anger, shyness . . . celebrate feelings in all their shapes and sizes in this full-color picture book from the Growing Hearts series! Our hearts can feel so many feelings! Some make us feel as light as a balloon, others as heavy as an elephant. In My Heart explores a full range of emotions, describing how they feel physically, inside, with language that is lyrical but also direct to empower readers to practice articulating and identifying their own emotions. With whimsical illustrations and an irresistible die-cut heart that extends through each spread, this gorgeously packaged and unique feelings book is sure to become a storytime and bedtime favorite. It will not only help your little boy or girl understand his or her feelings, but you may also hear, “Read it again! Read it again!” when you think it’s time for bed. The Growing Hearts series celebrates the milestones of a toddler’s emotional development, from conquering fears and expressing feelings to welcoming a new sibling. Read them all! Hello in There: A Big Sister’s Book of Waiting In My Heart: A Book of Feelings Brave As Can Be: A Book of Courage All My Treasures: A Book of Joy In My Room: A Book of Creativity and Imagination With My Daddy: A Book of Love and Family My Little Gifts: A Book of Sharing My Tree and Me: A Book of Seasons",
    "image": "http://books.google.com/books/content?id=WkpVEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781647008284.png"
  },
  {
    "title": "The Latte Factor",
    "authors": [
      "David Bach",
      "John David Mann"
    ],
    "isbn": "9781982120245",
    "edition": "3",
    "genre": "Business & Economics",
    "publisher": "Simon and Schuster",
    "published_date": "2019-05-07",
    "stock": 46,
    "status": "Checked Out",
    "description": "INSTANT NEW YORK TIMES, USA TODAY, WALL STREET JOURNAL, AND INTERNATIONAL BESTSELLER Discover #1 New York Times bestselling author David Bach’s three secrets to financial freedom in an engaging story that will show you that you are richer than you think. Drawing on the author’s experiences teaching millions of people around the world to live a rich life, this fast, easy listen reveals how anyone—from millennials to baby boomers—can still make his or her dreams come true. In this compelling, heartwarming parable, Bach and his bestselling coauthor John David Mann (The Go-Giver) tell the story of Zoey, a twenty-something woman living and working in New York City. Like many young professionals, Zoey is struggling to make ends meet under a growing burden of credit card and student loan debt, working crazy hours at her dream job but still not earning enough to provide a comfortable financial cushion. At her boss’s suggestion, she makes friends with Henry, the elderly barista at her favorite Brooklyn coffee shop. Henry soon reveals his “Three Secrets to Financial Freedom,” ideas Zoey dismisses at first but whose true power she ultimately comes to appreciate. Over the course of a single week, Zoey discovers that she already earns enough to secure her financial future and realize her truest dreams—all she has to do is make a few easy shifts in her everyday routine. The Latte Factor demystifies the secrets to achieving financial freedom, inspiring you to realize that it’s never too late to reach for your dreams. By following the simple, proven path that Henry shows Zoey, anyone can make small changes today that will have big impact for a lifetime, proving once again that “David Bach is the financial expert to listen to when you’re intimidated by your finances” (Tony Robbins, #1 New York Times bestselling author of Money: Master the Game).",
    "image": "http://books.google.com/books/content?id=_Ep9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781982120245.png"
  },
  {
    "title": "International Business Strategy and Cross-Cultural Management",
    "authors": [
      "Richter, Nicole F.",
      "Strandskov, Jesper",
      "Hauff, Sven",
      "Taras, Vasyl"
    ],
    "isbn": "9781839108631",
    "edition": "5",
    "genre": "Business & Economics",
    "publisher": "Edward Elgar Publishing",
    "published_date": "2022-03-15",
    "stock": 43,
    "status": "Available",
    "description": "This comprehensive yet accessible textbook provides readers with an advanced and applied approach to traditional international business that integrates key cross-cultural management topics. Its ten chapters give profound insights into analysing, selecting and entering international markets, strategic partnerships, strategic positioning, global value chains, organizational designs, intercultural interaction, leadership and motivation and international human resources management. For each of these topics, advanced and contemporary theoretical and analytical frameworks are discussed and translated into toolsets that will assist readers in solving practical challenges.",
    "image": "http://books.google.com/books/content?id=b61jEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781839108631.png"
  },
  {
    "title": "Little Fires Everywhere: Reese's Book Club",
    "authors": [
      "Celeste Ng"
    ],
    "isbn": "9780735224308",
    "edition": "1",
    "genre": "Fiction",
    "publisher": "Penguin",
    "published_date": "2017-09-12",
    "stock": 8,
    "status": "Reserved",
    "description": "The #1 New York Times bestseller • Named a Best Book of the Year by People, The Washington Post, Bustle, Esquire, Southern Living, The Daily Beast, GQ, Entertainment Weekly, NPR, Amazon, Barnes & Noble, iBooks, Audible, Goodreads, Library Reads, Book of the Month, Paste, Kirkus Reviews, St. Louis Post-Dispatch, and more “To say I love this book is an understatement. It’s a deep psychological mystery about the power of motherhood, the intensity of teenage love, and the danger of perfection. It moved me to tears.” —Reese Witherspoon From the bestselling author of Everything I Never Told You and Our Missing Hearts comes a riveting novel that traces the intertwined fates of the picture-perfect Richardson family and the enigmatic mother and daughter who upend their lives. In Shaker Heights, a placid, progressive suburb of Cleveland, everything is planned—from the layout of the winding roads, to the colors of the houses, to the successful lives its residents will go on to lead. And no one embodies this spirit more than Elena Richardson, whose guiding principle is playing by the rules. Enter Mia Warren—an enigmatic artist and single mother—who arrives in this idyllic bubble with her teenaged daughter Pearl, and rents a house from the Richardsons. Soon Mia and Pearl become more than tenants: all four Richardson children are drawn to the mother-daughter pair. But Mia carries with her a mysterious past and a disregard for the status quo that threatens to upend this carefully ordered community. When old family friends of the Richardsons attempt to adopt a Chinese-American baby, a custody battle erupts that dramatically divides the town—and puts Mia and Elena on opposing sides. Suspicious of Mia and her motives, Elena is determined to uncover the secrets in Mia’s past. But her obsession will come at unexpected and devastating costs. Little Fires Everywhere explores the weight of secrets, the nature of art and identity, and the ferocious pull of motherhood—and the danger of believing that following the rules can avert disaster. Named a Best Book of the Year by: People, The Washington Post, Bustle, Esquire, Southern Living, The Daily Beast, GQ, Entertainment Weekly, NPR, Amazon, Barnes & Noble, iBooks, Audible, Goodreads, Library Reads, Book of the Month, Paste, Kirkus Reviews, St. Louis Post-Dispatch, and more",
    "image": "http://books.google.com/books/content?id=OsUPDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780735224308.png"
  },
  {
    "title": "Oath of the Vayuputras",
    "authors": [
      "Amish Tripathi"
    ],
    "isbn": "9781681445038",
    "edition": "1",
    "genre": "Fiction",
    "publisher": "Jo Fletcher Books",
    "published_date": "2016-07-05",
    "stock": 11,
    "status": "Reserved",
    "description": "Today, Shiva is a god. But four thousand years ago, he was just a man - until he brought his people to Meluha, a near-perfect empire founded by the great king Lord Ram. There he discovered he was the Neelkanth, a barbarian long prophesied to be Meluha's savior. But in his hour of victory fighting the Chandravanshis - Meluha's enemy - he discovered they had their own prophecy. Now he must fight to uncover the treachery within his inner circle, and unmask those who are about to destroy all that he has fought for. Shiva is about to learn that good and evil are two sides of the same coin...",
    "image": "http://books.google.com/books/content?id=vPTaCgAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9781681445038.png"
  },
  {
    "title": "Worlds Collide",
    "authors": [
      "Chris Colfer"
    ],
    "isbn": "9781536440898",
    "edition": "1",
    "genre": "",
    "publisher": null,
    "published_date": "2018-06-12",
    "stock": 20,
    "status": "Checked Out",
    "description": "Conner and Alex must brave the impossible. All of the Land of Stories fairy-tale characters--heroes and villains--are no longer confined within their world! Conner doesn't think the situation could get any worse. That is, until Alex goes missing!",
    "image": "http://books.google.com/books/content?id=mS1tzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9781536440898.png"
  },
  {
    "title": "Katmere Academy: An Insider’s Guide",
    "authors": [
      "Tracy Wolff"
    ],
    "isbn": "9781649372734",
    "edition": "4",
    "genre": "Young Adult Fiction",
    "publisher": "Entangled: Teen",
    "published_date": "2021-11-23",
    "stock": 11,
    "status": "Available",
    "description": "Get an exclusive peek inside the global sensation and international bestselling Crave series from #1 New York Times bestselling author Tracy Wolff—with new revelations and shocking secrets never before revealed! Always wanted to be a student at the boarding school with bite? The Katmere Academy Insider’s Guide will transport you. Explore everything Katmere has to offer and get lost within its walls with exclusive bonus content available for the very first time. Katmere Insiders will be able to dig deeper with full character bios—from Grace, the Vega brothers, Macy, and Flint to fan favorites like Eden, Remy, and even Byron. Get to know the staff, learn the history of some of the most unique and exciting traditions at Katmere, and discover which Court you would belong to. And, of course, enjoy numerous deleted scenes and outrageous outtakes from your favorite characters’ POVs, giving readers insights into Crave series lore not found anywhere else. Bonus features include a never-before-seen Q&A with Tracy Wolff, where she reveals insider information about the series fans won’t want to miss, as well as a brand-new novella from Hudson’s POV! Don’t miss a single book in the series that spawned a phenomenon! The Crave series is best enjoyed in order: Crave Crush Covet Court Charm Cherish",
    "image": "http://books.google.com/books/content?id=QKxIEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781649372734.png"
  },
  {
    "title": "One of Us Is Lying",
    "authors": [
      "Karen M. McManus"
    ],
    "isbn": "9780141375649",
    "edition": "5",
    "genre": "Young Adult Fiction",
    "publisher": "Penguin UK",
    "published_date": "2017-06-01",
    "stock": 6,
    "status": "Reserved",
    "description": "The international bestselling YA thriller by acclaimed author Karen M. McManus - now available in a bold new cover look complete with a blood red background and matching sprayed edges. Five students walk into detention. Only four come out alive. Yale hopeful Bronwyn has never publicly broken a rule. Sports star Cooper only knows what he's doing in the baseball diamond. Bad boy Nate is one misstep away from a life of crime. Prom queen Addy is holding together the cracks in her perfect life. And outsider Simon, creator of the notorious gossip app at Bayview High, won't ever talk about any of them again. He dies 24 hours before he could post their deepest secrets online. Investigators conclude it's no accident. All of them are suspects. Everyone has secrets, right? What really matters is how far you'll go to protect them. 'Tightly plotted and brilliantly written, with sharp, believable characters, this whodunit is utterly irresistible' - HEAT 'Twisty plotting, breakneck pacing and intriguing characterisation add up to an exciting single-sitting thrillerish treat' -THE GUARDIAN 'A fantastic murder mystery, packed with cryptic clues and countless plot twists. I could not put this book down' - THE SUN 'Pretty Little Liars meets The Breakfast Club' - ENTERTAINMENT WEEKLY But the story doesn't end here, it continues with One of Us Is Next. . .",
    "image": "http://books.google.com/books/content?id=F_qhDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780141375649.png"
  },
  {
    "title": "I'm Not Scared, You're Scared",
    "authors": [
      "Seth Meyers"
    ],
    "isbn": "9780593352403",
    "edition": "4",
    "genre": "Juvenile Fiction",
    "publisher": "Penguin",
    "published_date": "2022-03-15",
    "stock": 28,
    "status": "Checked Out",
    "description": "From the incomparable host of “Late Night with Seth Meyers” comes a hilarious new picture book. When you're a bear who is easily scared, it's hard to have friends. Fortunately, Bear has one: Rabbit, who is very brave. One day, Rabbit urges Bear to face his fears and embark on an adventure together. However, things don't entirely go as planned, and the two friends learn the true meaning of bravery. Equal parts hilarious and touching, this funny tale of adventure, bravery, and daring rescue will both inspire the adventurous spirit in all of us and make us laugh along the way. With the unfailingly witty voice of one of America's favorite comedians, Seth Meyers's debut picture book is bound for hilarity history.",
    "image": "http://books.google.com/books/content?id=nsZEEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780593352403.png"
  },
  {
    "title": "The Reality-Based Rules of the Workplace",
    "authors": [
      "Cy Wakeman"
    ],
    "isbn": "9781118585672",
    "edition": "3",
    "genre": "Business & Economics",
    "publisher": "John Wiley & Sons",
    "published_date": "2013-04-16",
    "stock": 8,
    "status": "Reserved",
    "description": "The key to understanding how your manager calculates your real value—and how to boost it More than anything else, you need to understand exactly how your employer evaluates you, and your annual performance review doesn't tell the whole story. In The Reality-Based Rules of the Workplace, Cy Wakeman shows how to calculate how your true value to your organization by understanding your current and future potential against your \"emotional expense\"—the toll your actions and attitudes take on the people around you. With Cy's clear, straight-to-the-point advice, you can confront and reduce your emotional costliness, become an invaluable member of your team, and even learn to love your job again. Reveals a formula for measuring your current performance, future potential, and the biggest detractor, your emotional expense Shares real-world advice for quickly boosting your value and becoming a highly-valued, sought after employee and teammate Builds on the lessons in Reality-Based Leadership, Cy Wakeman's first book for leaders and managers The Reality-Based Rules of the Workplace is the essential guide for boosting your value, owning your career, and becoming the kind of employee no organization can afford to lose.",
    "image": "http://books.google.com/books/content?id=-LM77OqGIEkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781118585672.png"
  },
  {
    "title": "Plug Your Book!",
    "authors": [
      "Steve Weber"
    ],
    "isbn": "9780977240616",
    "edition": "2",
    "genre": "Computers",
    "publisher": "Stephen Weber",
    "published_date": "2007",
    "stock": 25,
    "status": "Checked Out",
    "description": "",
    "image": "http://books.google.com/books/content?id=a1YN6_KnswoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780977240616.png"
  },
  {
    "title": "Blood in the Garden",
    "authors": [
      "Chris Herring"
    ],
    "isbn": "9781982132125",
    "edition": "3",
    "genre": "Biography & Autobiography",
    "publisher": "Simon and Schuster",
    "published_date": "2024-11-12",
    "stock": 19,
    "status": "Reserved",
    "description": "For nearly an entire generation the New York Knicks have been a laughingstock franchise. But in the 1990s they had earned respect not only by winning, but also through brute force. The Knicks fought opponents. They fought each other. They even fought their own coaches at time-- and coach Pat Riley encouraged the nastiness. They never won a championship in those years-- but endeared themselves to millions of fans. Herring delves into the origin, evolution, and eventual demise of the iconic club in eye-opening detail. He pulls no punches-- which is just how those rough-and-tumble Knights would like it. -- adapted from jacket",
    "image": "http://books.google.com/books/content?id=6sEpEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9781982132125.png"
  },
  {
    "title": "The Nightingale",
    "authors": [
      "Kristin Hannah"
    ],
    "isbn": "9781427212672",
    "edition": "4",
    "genre": "Fiction",
    "publisher": "Macmillan Audio",
    "published_date": "2015-02-03",
    "stock": 12,
    "status": "Reserved",
    "description": "In love we find out who we want to be. In war we find out who we are. FRANCE, 1939 In the quiet village of Carriveau, Vianne Mauriac says goodbye to her husband, Antoine, as he heads for the Front. She doesn't believe that the Nazis will invade France...but invade they do, in droves of marching soldiers, in caravans of trucks and tanks, in planes that fill the skies and drop bombs upon the innocent. When a German captain requisitions Vianne's home, she and her daughter must live with the enemy or lose everything. Without food or money or hope, as danger escalates all around them, she is forced to make one impossible choice after another to keep her family alive. Vianne's sister, Isabelle, is a rebellious eighteen-year-old girl, searching for purpose with all the reckless passion of youth. While thousands of Parisians march into the unknown terrors of war, she meets Gäetan, a partisan who believes the French can fight the Nazis from within France, and she falls in love as only the young can...completely. But when he betrays her, Isabelle joins the Resistance and never looks back, risking her life time and again to save others. With courage, grace and powerful insight, bestselling author Kristin Hannah captures the epic panorama of WWII and illuminates an intimate part of history seldom seen: the women's war. The Nightingale tells the stories of two sisters, separated by years and experience, by ideals, passion and circumstance, each embarking on her own dangerous path toward survival, love, and freedom in German-occupied, war-torn France--a heartbreakingly beautiful novel that celebrates the resilience of the human spirit and the durability of women. It is a novel for everyone, a novel for a lifetime.",
    "image": "http://books.google.com/books/content?id=asSWvgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9781427212672.png"
  },
  {
    "title": "Pulp",
    "authors": [
      "Scott McCracken"
    ],
    "isbn": "9780719047596",
    "edition": "5",
    "genre": "Fiction",
    "publisher": "Manchester University Press",
    "published_date": "1998-09-15",
    "stock": 10,
    "status": "Checked Out",
    "description": "Bringing together chapters on the bestseller, detective fiction, popular romance, science fiction and horror, this text provides an account of the cultural theories that have informed the study of popular fiction.",
    "image": "http://books.google.com/books/content?id=wVNWTrtfv_UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "image_local": "book_images\\9780719047596.png"
  },
  {
    "title": "Little Legends: Exceptional Men in Black History",
    "authors": [
      "Vashti Harrison"
    ],
    "isbn": "9780316475167",
    "edition": "1",
    "genre": "Juvenile Nonfiction",
    "publisher": "Little, Brown Books for Young Readers",
    "published_date": "2019-11-19",
    "stock": 49,
    "status": "Available",
    "description": "Author-illustrator Vashti Harrison shines a bold, joyous light on black men through history in this #1 New York Times bestseller. An important book for readers of all ages, this beautifully illustrated and engagingly written volume brings to life true stories of black men in history. Among these biographies, readers will find aviators and artists, politicians and pop stars, athletes and activists. The exceptional men featured include writer James Baldwin, artist Aaron Douglas, filmmaker Oscar Devereaux Micheaux, lawman Bass Reeves, civil rights leader John Lewis, dancer Alvin Ailey, and musician Prince. The legends in Little Legends: Exceptional Men in Black History span centuries and continents, but each one has blazed a trail for generations to come.",
    "image": "http://books.google.com/books/content?id=CMyMDwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9780316475167.png"
  },
  {
    "title": "Never Split the Difference",
    "authors": [
      "Chris Voss",
      "Tahl Raz"
    ],
    "isbn": "9780062872302",
    "edition": "5",
    "genre": "Business & Economics",
    "publisher": "HarperBusiness",
    "published_date": "2018-06-05",
    "stock": 14,
    "status": "Checked Out",
    "description": "From policing the rough streets of Kansas City, Missouri, to becoming the FBI’s lead international kidnapping negotiator to teaching negotiation at leading universities, Chris Voss has tested the techniques in Never Split the Difference across the full spectrum of human endeavor and proved their effectiveness. Those who have benefited from these techniques include business clients generating millions in additional profits, MBA students getting better jobs, and even parents dealing with their kids. Never Split the Difference provides a gripping, behind-the-scenes recounting of dramatic scenarios from the gang-infested streets of Haiti to a Brooklyn bank robbery gone horribly wrong, revealing the negotiation strategies that helped Voss and his colleagues succeed where it mattered most: saving lives. Whether buying a car, getting a better raise, buying a home, renegotiating rent, or deliberating with your partner, Voss shows you how to use these skills in the workplace and in every other realm of your life.",
    "image": "http://books.google.com/books/content?id=PkPRswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9780062872302.png"
  },
  {
    "title": "Run, Rose, Run",
    "authors": [
      "James Patterson",
      "Dolly Parton"
    ],
    "isbn": "9781538723975",
    "edition": "2",
    "genre": "",
    "publisher": null,
    "published_date": "2024-07-23",
    "stock": 33,
    "status": "Available",
    "description": "From America's most beloved superstar and #1 New York Times bestselling author James Patterson comes a thriller about a young singer-songwriter on the rise--and on the run--and determined to do whatever it takes to survive. A new singer arrives in Nashville. She calls herself AnnieLee Keyes, and she has more beauty, talent, and ambition than most -- and a dangerous past that she's running from. Her performance of original songs at open-mic night at the Cat's Paw Saloon downtown transfixes Ethan Blake, back-up musician for country star Ruthanna Ryder. Ruthanna may have retired--for deeply personal reasons--but that doesn't mean she's stopped writing music. Every day, she records songs she'll never release. When Ruthanna hears AnnieLee sing, the legend decides to help the ingenue. But a boost from a mega-star like Ruthanna may spotlight the talented newcomer's secret. Now AnnieLee may not live long enough to realize her dreams of stardom--or for the world to learn her true identity.",
    "image": "http://books.google.com/books/content?id=DIdV0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9781538723975.png"
  },
  {
    "title": "Guinness World Records 2022",
    "authors": [],
    "isbn": "9781913484118",
    "edition": "5",
    "genre": "",
    "publisher": null,
    "published_date": "2022",
    "stock": 0,
    "status": "Checked Out",
    "description": "",
    "image": "http://books.google.com/books/content?id=0mVkzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9781913484118.png"
  },
  {
    "title": "The Wednesday Letters",
    "authors": [
      "Jason F. Wright"
    ],
    "isbn": "9781602851351",
    "edition": "5",
    "genre": "Fiction",
    "publisher": "Center Point Pub",
    "published_date": "2007",
    "stock": 22,
    "status": "Checked Out",
    "description": "They died in each other's arms, but their secrets did not die with them. Shocking truths about their past are uncovered through the Wednesday letters.",
    "image": "http://books.google.com/books/content?id=GHFKPgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9781602851351.png"
  },
  {
    "title": "The Frankfurt Book Fair and Bestseller Business",
    "authors": [
      "Beth Driscoll",
      "Claire Squires"
    ],
    "isbn": "9781108945301",
    "edition": "3",
    "genre": "Language Arts & Disciplines",
    "publisher": "Cambridge University Press",
    "published_date": "2020-10-22",
    "stock": 17,
    "status": "Reserved",
    "description": "The Frankfurt Book Fair is the leading global industry venue for rights sales, facilitating business-to-buzzness deals and international networks. In this Element, we pursue an Ullapoolist approach to excavate beneath the production of bestsellers at the Fair. Our investigation involved three consecutive years of fieldwork (2017–2019) including interviews and autoethnographic, arts-informed interventions. The Element argues that buzz at the Fair exists in two states: as market-ready media reports and partial, lived experiences linked to mood. The physical structures and absences of the Fair enact its power relations and direct the flow of books and buzz. Further, the Fair is not only a site for commercial exchange but a carnival of sorts, marked by disruptive historical events and problematic socio-political dynamics. Key themes emerging from the Element are the presence of excess, the pseudo(neo)liberal self-satisfaction of book culture, and the interplay of optimism and pessimism in contemporary publishing.",
    "image": "http://books.google.com/books/content?id=k7EfEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "image_local": "book_images\\9781108945301.png"
  }
]